bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once


#ifdef __cplusplus
extern "C" {
#endif


#define SYS_AONP_REG0_ADDR (SOC_SYS_AONP_REG_BASE + (0x0 << 2))

#define SYS_AONP_REG0_DEVICEID_POS (0)
#define SYS_AONP_REG0_DEVICEID_MASK (0xffffffff)

#define SYS_AONP_REG1_ADDR (SOC_SYS_AONP_REG_BASE + (0x1 << 2))

#define SYS_AONP_REG1_VERSIONID_POS (0)
#define SYS_AONP_REG1_VERSIONID_MASK (0xffffffff)

#define SYS_AONP_REG2_ADDR (SOC_SYS_AONP_REG_BASE + (0x2 << 2))

#define SYS_AONP_REG2_BOOT_MODE_POS (0)
#define SYS_AONP_REG2_BOOT_MODE_MASK (0x1)

#define SYS_AONP_REG2_CLKG_BPS_POS (1)
#define SYS_AONP_REG2_CLKG_BPS_MASK (0x1)

#define SYS_AONP_REG2_RESERVED_BIT_2_3_POS (2)
#define SYS_AONP_REG2_RESERVED_BIT_2_3_MASK (0x3)

#define SYS_AONP_REG2_RF_SWITCH_MANUAL_EN_POS (4)
#define SYS_AONP_REG2_RF_SWITCH_MANUAL_EN_MASK (0x1)

#define SYS_AONP_REG2_RF_SOURCE_POS (5)
#define SYS_AONP_REG2_RF_SOURCE_MASK (0x3)

#define SYS_AONP_REG2_JTAG_CORE_SEL_POS (7)
#define SYS_AONP_REG2_JTAG_CORE_SEL_MASK (0x1)

#define SYS_AONP_REG2_RESERVED_BIT_8_8_POS (8)
#define SYS_AONP_REG2_RESERVED_BIT_8_8_MASK (0x1)

#define SYS_AONP_REG2_FLASH_SEL_POS (9)
#define SYS_AONP_REG2_FLASH_SEL_MASK (0x1)

#define SYS_AONP_REG2_FEM_BPS_TXEN_POS (10)
#define SYS_AONP_REG2_FEM_BPS_TXEN_MASK (0x1)

#define SYS_AONP_REG2_GPIO_FLASH_SYS_ENABLE_POS (11)
#define SYS_AONP_REG2_GPIO_FLASH_SYS_ENABLE_MASK (0x1)

#define SYS_AONP_REG2_BOOT_MODE_NORST_POS (12)
#define SYS_AONP_REG2_BOOT_MODE_NORST_MASK (0x1)

#define SYS_AONP_REG2_RESERVED_BIT_13_31_POS (13)
#define SYS_AONP_REG2_RESERVED_BIT_13_31_MASK (0x7ffff)

#define SYS_AONP_REG3_ADDR (SOC_SYS_AONP_REG_BASE + (0x3 << 2))

#define SYS_AONP_REG3_CORE0_HALTED_POS (0)
#define SYS_AONP_REG3_CORE0_HALTED_MASK (0x1)

#define SYS_AONP_REG3_CORE1_HALTED_POS (1)
#define SYS_AONP_REG3_CORE1_HALTED_MASK (0x1)

#define SYS_AONP_REG3_RESERVED_BIT_2_3_POS (2)
#define SYS_AONP_REG3_RESERVED_BIT_2_3_MASK (0x3)

#define SYS_AONP_REG3_CPU0_SW_RESET_POS (4)
#define SYS_AONP_REG3_CPU0_SW_RESET_MASK (0x1)

#define SYS_AONP_REG3_CPU1_SW_RESET_POS (5)
#define SYS_AONP_REG3_CPU1_SW_RESET_MASK (0x1)

#define SYS_AONP_REG3_RESERVED_BIT_6_7_POS (6)
#define SYS_AONP_REG3_RESERVED_BIT_6_7_MASK (0x3)

#define SYS_AONP_REG3_CPU0_PWR_DW_STATE_POS (8)
#define SYS_AONP_REG3_CPU0_PWR_DW_STATE_MASK (0x1)

#define SYS_AONP_REG3_CPU1_PWR_DW_STATE_POS (9)
#define SYS_AONP_REG3_CPU1_PWR_DW_STATE_MASK (0x1)

#define SYS_AONP_REG3_RESERVED_BIT_10_11_POS (10)
#define SYS_AONP_REG3_RESERVED_BIT_10_11_MASK (0x3)

#define SYS_AONP_REG3_CPU0_EXIST_POS (12)
#define SYS_AONP_REG3_CPU0_EXIST_MASK (0x1)

#define SYS_AONP_REG3_CPU1_EXIST_POS (13)
#define SYS_AONP_REG3_CPU1_EXIST_MASK (0x1)

#define SYS_AONP_REG3_CPU2_EXIST_POS (14)
#define SYS_AONP_REG3_CPU2_EXIST_MASK (0x1)

#define SYS_AONP_REG3_CPU3_EXIST_POS (15)
#define SYS_AONP_REG3_CPU3_EXIST_MASK (0x1)

#define SYS_AONP_REG3_RESERVED_BIT_16_31_POS (16)
#define SYS_AONP_REG3_RESERVED_BIT_16_31_MASK (0xffff)

#define SYS_AONP_REG4_ADDR (SOC_SYS_AONP_REG_BASE + (0x4 << 2))

#define SYS_AONP_REG4_CPU0_SW_RST_POS (0)
#define SYS_AONP_REG4_CPU0_SW_RST_MASK (0x1)

#define SYS_AONP_REG4_CPU0_PWR_DW_POS (1)
#define SYS_AONP_REG4_CPU0_PWR_DW_MASK (0x1)

#define SYS_AONP_REG4_CPU_INT_MASK_POS (2)
#define SYS_AONP_REG4_CPU_INT_MASK_MASK (0x1)

#define SYS_AONP_REG4_CPU0_HALT_POS (3)
#define SYS_AONP_REG4_CPU0_HALT_MASK (0x1)

#define SYS_AONP_REG4_RESERVED_BIT_4_4_POS (4)
#define SYS_AONP_REG4_RESERVED_BIT_4_4_MASK (0x1)

#define SYS_AONP_REG4_CPU0_RXEVT_SEL_POS (5)
#define SYS_AONP_REG4_CPU0_RXEVT_SEL_MASK (0x3)

#define SYS_AONP_REG4_RESERVED_7_7_POS (7)
#define SYS_AONP_REG4_RESERVED_7_7_MASK (0x1)

#define SYS_AONP_REG4_CPU0_OFFSET_POS (8)
#define SYS_AONP_REG4_CPU0_OFFSET_MASK (0xffffff)

#define SYS_AONP_REG5_ADDR (SOC_SYS_AONP_REG_BASE + (0x5 << 2))

#define SYS_AONP_REG5_CPU1_SW_RST_POS (0)
#define SYS_AONP_REG5_CPU1_SW_RST_MASK (0x1)

#define SYS_AONP_REG5_CPU1_PWR_DW_POS (1)
#define SYS_AONP_REG5_CPU1_PWR_DW_MASK (0x1)

#define SYS_AONP_REG5_RESERVED_2_2_POS (2)
#define SYS_AONP_REG5_RESERVED_2_2_MASK (0x1)

#define SYS_AONP_REG5_CPU1_HALT_POS (3)
#define SYS_AONP_REG5_CPU1_HALT_MASK (0x1)

#define SYS_AONP_REG5_RESERVED_BIT_4_4_POS (4)
#define SYS_AONP_REG5_RESERVED_BIT_4_4_MASK (0x1)

#define SYS_AONP_REG5_CPU1_RXEVT_SEL_POS (5)
#define SYS_AONP_REG5_CPU1_RXEVT_SEL_MASK (0x3)

#define SYS_AONP_REG5_RESERVED_7_7_POS (7)
#define SYS_AONP_REG5_RESERVED_7_7_MASK (0x1)

#define SYS_AONP_REG5_CPU1_OFFSET_POS (8)
#define SYS_AONP_REG5_CPU1_OFFSET_MASK (0xffffff)

#define SYS_AONP_REG8_ADDR (SOC_SYS_AONP_REG_BASE + (0x8 << 2))

#define SYS_AONP_REG8_CKSEL_CORE_POS (0)
#define SYS_AONP_REG8_CKSEL_CORE_MASK (0x3)

#define SYS_AONP_REG8_CKDIV_CORE_POS (2)
#define SYS_AONP_REG8_CKDIV_CORE_MASK (0xf)

#define SYS_AONP_REG8_CKSEL_FLASH_POS (6)
#define SYS_AONP_REG8_CKSEL_FLASH_MASK (0x3)

#define SYS_AONP_REG8_CKDIV_FLASH_POS (8)
#define SYS_AONP_REG8_CKDIV_FLASH_MASK (0x7)

#define SYS_AONP_REG8_CKSEL_AUXS_POS (11)
#define SYS_AONP_REG8_CKSEL_AUXS_MASK (0x3)

#define SYS_AONP_REG8_CKDIV_AUXS_POS (13)
#define SYS_AONP_REG8_CKDIV_AUXS_MASK (0x3f)

#define SYS_AONP_REG8_CKDIV_26MO_POS (19)
#define SYS_AONP_REG8_CKDIV_26MO_MASK (0x7)

#define SYS_AONP_REG8_RESERVED_22_23_POS (22)
#define SYS_AONP_REG8_RESERVED_22_23_MASK (0x3)

#define SYS_AONP_REG8_PHASE_CFG_960M_POS (24)
#define SYS_AONP_REG8_PHASE_CFG_960M_MASK (0xff)

#define SYS_AONP_REG9_ADDR (SOC_SYS_AONP_REG_BASE + (0x9 << 2))

#define SYS_AONP_REG9_CKSEL_I2C0_POS (0)
#define SYS_AONP_REG9_CKSEL_I2C0_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_I2C3_POS (1)
#define SYS_AONP_REG9_CKSEL_I2C3_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_UART0_POS (2)
#define SYS_AONP_REG9_CKSEL_UART0_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_UART1_POS (3)
#define SYS_AONP_REG9_CKSEL_UART1_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_UART2_POS (4)
#define SYS_AONP_REG9_CKSEL_UART2_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_UART3_POS (5)
#define SYS_AONP_REG9_CKSEL_UART3_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_UART4_POS (6)
#define SYS_AONP_REG9_CKSEL_UART4_MASK (0x1)

