bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_REG9_CKSEL_SPI0_POS (7)
#define SYS_AONP_REG9_CKSEL_SPI0_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_SPI1_POS (8)
#define SYS_AONP_REG9_CKSEL_SPI1_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_SPI2_POS (9)
#define SYS_AONP_REG9_CKSEL_SPI2_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_SPI3_POS (10)
#define SYS_AONP_REG9_CKSEL_SPI3_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_I2S0_POS (11)
#define SYS_AONP_REG9_CKSEL_I2S0_MASK (0x1)

#define SYS_AONP_REG9_CKDIV_I2S0_POS (12)
#define SYS_AONP_REG9_CKDIV_I2S0_MASK (0x3)

#define SYS_AONP_REG9_CKSEL_I2S1_POS (14)
#define SYS_AONP_REG9_CKSEL_I2S1_MASK (0x1)

#define SYS_AONP_REG9_CKDIV_I2S1_POS (15)
#define SYS_AONP_REG9_CKDIV_I2S1_MASK (0x3)

#define SYS_AONP_REG9_CKSEL_I2S2_POS (17)
#define SYS_AONP_REG9_CKSEL_I2S2_MASK (0x1)

#define SYS_AONP_REG9_CKDIV_I2S2_POS (18)
#define SYS_AONP_REG9_CKDIV_I2S2_MASK (0x3)

#define SYS_AONP_REG9_CKSEL_I2S3_POS (20)
#define SYS_AONP_REG9_CKSEL_I2S3_MASK (0x1)

#define SYS_AONP_REG9_CKDIV_I2S3_POS (21)
#define SYS_AONP_REG9_CKDIV_I2S3_MASK (0x3)

#define SYS_AONP_REG9_CKSEL_I2S4_POS (23)
#define SYS_AONP_REG9_CKSEL_I2S4_MASK (0x1)

#define SYS_AONP_REG9_CKDIV_I2S4_POS (24)
#define SYS_AONP_REG9_CKDIV_I2S4_MASK (0x3)

#define SYS_AONP_REG9_CKSEL_SADC_POS (26)
#define SYS_AONP_REG9_CKSEL_SADC_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_I3C_POS (27)
#define SYS_AONP_REG9_CKSEL_I3C_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_TIM0_POS (28)
#define SYS_AONP_REG9_CKSEL_TIM0_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_TIM1_POS (29)
#define SYS_AONP_REG9_CKSEL_TIM1_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_TIM2_POS (30)
#define SYS_AONP_REG9_CKSEL_TIM2_MASK (0x1)

#define SYS_AONP_REG9_CKSEL_TIM3_POS (31)
#define SYS_AONP_REG9_CKSEL_TIM3_MASK (0x1)

#define SYS_AONP_REGA_ADDR (SOC_SYS_AONP_REG_BASE + (0xa << 2))

#define SYS_AONP_REGA_CKSEL_PWM0_POS (0)
#define SYS_AONP_REGA_CKSEL_PWM0_MASK (0x1)

#define SYS_AONP_REGA_CKSEL_CAN0_POS (1)
#define SYS_AONP_REGA_CKSEL_CAN0_MASK (0x1)

#define SYS_AONP_REGA_CKSEL_CAN1_POS (2)
#define SYS_AONP_REGA_CKSEL_CAN1_MASK (0x1)

#define SYS_AONP_REGA_CKSEL_SCR0_POS (3)
#define SYS_AONP_REGA_CKSEL_SCR0_MASK (0x1)

#define SYS_AONP_REGA_CKSEL_AUDIO_POS (4)
#define SYS_AONP_REGA_CKSEL_AUDIO_MASK (0x1)

#define SYS_AONP_REGA_CKDIV_AUDIO_POS (5)
#define SYS_AONP_REGA_CKDIV_AUDIO_MASK (0x7)

#define SYS_AONP_REGA_CKSEL_AUDIF0_POS (8)
#define SYS_AONP_REGA_CKSEL_AUDIF0_MASK (0x1)

#define SYS_AONP_REGA_CKDIV_AUDIF0_POS (9)
#define SYS_AONP_REGA_CKDIV_AUDIF0_MASK (0x7)

#define SYS_AONP_REGA_CKSEL_AUDIF1_POS (12)
#define SYS_AONP_REGA_CKSEL_AUDIF1_MASK (0x1)

#define SYS_AONP_REGA_CKDIV_AUDIF1_POS (13)
#define SYS_AONP_REGA_CKDIV_AUDIF1_MASK (0x7)

#define SYS_AONP_REGA_CKDIV_I2SO_POS (16)
#define SYS_AONP_REGA_CKDIV_I2SO_MASK (0x7)

#define SYS_AONP_REGA_CKSEL_AUXS_ENET_POS (19)
#define SYS_AONP_REGA_CKSEL_AUXS_ENET_MASK (0x1)

#define SYS_AONP_REGA_CKDIV_AUXS_ENET_POS (20)
#define SYS_AONP_REGA_CKDIV_AUXS_ENET_MASK (0xf)

#define SYS_AONP_REGA_CKSEL_TRACE_POS (24)
#define SYS_AONP_REGA_CKSEL_TRACE_MASK (0x1)

#define SYS_AONP_REGA_CKDIV_TRACE_POS (25)
#define SYS_AONP_REGA_CKDIV_TRACE_MASK (0x7)

#define SYS_AONP_REGA_RESERVED_28_31_POS (28)
#define SYS_AONP_REGA_RESERVED_28_31_MASK (0xf)

#define SYS_AONP_REGB_ADDR (SOC_SYS_AONP_REG_BASE + (0xb << 2))

#define SYS_AONP_REGB_ANASPI_FREQ_POS (0)
#define SYS_AONP_REGB_ANASPI_FREQ_MASK (0x3f)

#define SYS_AONP_REGB_RESERVED_BIT_6_31_POS (6)
#define SYS_AONP_REGB_RESERVED_BIT_6_31_MASK (0x3ffffff)

#define SYS_AONP_REGC_ADDR (SOC_SYS_AONP_REG_BASE + (0xc << 2))

#define SYS_AONP_REGC_TIM0_CKEN_POS (0)
#define SYS_AONP_REGC_TIM0_CKEN_MASK (0x1)

#define SYS_AONP_REGC_TIM1_CKEN_POS (1)
#define SYS_AONP_REGC_TIM1_CKEN_MASK (0x1)

#define SYS_AONP_REGC_TIM2_CKEN_POS (2)
#define SYS_AONP_REGC_TIM2_CKEN_MASK (0x1)

#define SYS_AONP_REGC_TIM3_CKEN_POS (3)
#define SYS_AONP_REGC_TIM3_CKEN_MASK (0x1)

#define SYS_AONP_REGC_UART0_CKEN_POS (4)
#define SYS_AONP_REGC_UART0_CKEN_MASK (0x1)

#define SYS_AONP_REGC_UART1_CKEN_POS (5)
#define SYS_AONP_REGC_UART1_CKEN_MASK (0x1)

#define SYS_AONP_REGC_UART2_CKEN_POS (6)
#define SYS_AONP_REGC_UART2_CKEN_MASK (0x1)

#define SYS_AONP_REGC_UART3_CKEN_POS (7)
#define SYS_AONP_REGC_UART3_CKEN_MASK (0x1)

#define SYS_AONP_REGC_UART4_CKEN_POS (8)
#define SYS_AONP_REGC_UART4_CKEN_MASK (0x1)

#define SYS_AONP_REGC_SPI0_CKEN_POS (9)
#define SYS_AONP_REGC_SPI0_CKEN_MASK (0x1)

#define SYS_AONP_REGC_SPI1_CKEN_POS (10)
#define SYS_AONP_REGC_SPI1_CKEN_MASK (0x1)

#define SYS_AONP_REGC_SPI2_CKEN_POS (11)
#define SYS_AONP_REGC_SPI2_CKEN_MASK (0x1)

#define SYS_AONP_REGC_SPI3_CKEN_POS (12)
#define SYS_AONP_REGC_SPI3_CKEN_MASK (0x1)

#define SYS_AONP_REGC_SADC_CKEN_POS (13)
#define SYS_AONP_REGC_SADC_CKEN_MASK (0x1)

#define SYS_AONP_REGC_PWM0_CKEN_POS (14)
#define SYS_AONP_REGC_PWM0_CKEN_MASK (0x1)

#define SYS_AONP_REGC_OTP_CKEN_POS (15)
#define SYS_AONP_REGC_OTP_CKEN_MASK (0x1)

#define SYS_AONP_REGC_I3C_CKEN_POS (16)
#define SYS_AONP_REGC_I3C_CKEN_MASK (0x1)

#define SYS_AONP_REGC_I2S0_CKEN_POS (17)
#define SYS_AONP_REGC_I2S0_CKEN_MASK (0x1)

#define SYS_AONP_REGC_I2S1_CKEN_POS (18)
#define SYS_AONP_REGC_I2S1_CKEN_MASK (0x1)

#define SYS_AONP_REGC_I2S2_CKEN_POS (19)
#define SYS_AONP_REGC_I2S2_CKEN_MASK (0x1)

#define SYS_AONP_REGC_I2S3_CKEN_POS (20)
#define SYS_AONP_REGC_I2S3_CKEN_MASK (0x1)

#define SYS_AONP_REGC_I2S4_CKEN_POS (21)
#define SYS_AONP_REGC_I2S4_CKEN_MASK (0x1)

#define SYS_AONP_REGC_I2C0_CKEN_POS (22)
#define SYS_AONP_REGC_I2C0_CKEN_MASK (0x1)

#define SYS_AONP_REGC_I2C3_CKEN_POS (23)
#define SYS_AONP_REGC_I2C3_CKEN_MASK (0x1)

#define SYS_AONP_REGC_IRDA0_CKEN_POS (24)
#define SYS_AONP_REGC_IRDA0_CKEN_MASK (0x1)

#define SYS_AONP_REGC_IRDA1_CKEN_POS (25)
#define SYS_AONP_REGC_IRDA1_CKEN_MASK (0x1)

#define SYS_AONP_REGC_IRDA2_CKEN_POS (26)
#define SYS_AONP_REGC_IRDA2_CKEN_MASK (0x1)

