bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_REGC_IRDA3_CKEN_POS (27)
#define SYS_AONP_REGC_IRDA3_CKEN_MASK (0x1)

#define SYS_AONP_REGC_CAN0_CKEN_POS (28)
#define SYS_AONP_REGC_CAN0_CKEN_MASK (0x1)

#define SYS_AONP_REGC_CAN1_CKEN_POS (29)
#define SYS_AONP_REGC_CAN1_CKEN_MASK (0x1)

#define SYS_AONP_REGC_LIN0_CKEN_POS (30)
#define SYS_AONP_REGC_LIN0_CKEN_MASK (0x1)

#define SYS_AONP_REGC_SCR0_CKEN_POS (31)
#define SYS_AONP_REGC_SCR0_CKEN_MASK (0x1)

#define SYS_AONP_REGD_ADDR (SOC_SYS_AONP_REG_BASE + (0xd << 2))

#define SYS_AONP_REGD_AUDIO_CKEN_POS (0)
#define SYS_AONP_REGD_AUDIO_CKEN_MASK (0x1)

#define SYS_AONP_REGD_AUDIF0_CKEN_POS (1)
#define SYS_AONP_REGD_AUDIF0_CKEN_MASK (0x1)

#define SYS_AONP_REGD_AUDIF1_CKEN_POS (2)
#define SYS_AONP_REGD_AUDIF1_CKEN_MASK (0x1)

#define SYS_AONP_REGD_I2SO_CKEN_POS (3)
#define SYS_AONP_REGD_I2SO_CKEN_MASK (0x1)

#define SYS_AONP_REGD_CEC_CKEN_POS (4)
#define SYS_AONP_REGD_CEC_CKEN_MASK (0x1)

#define SYS_AONP_REGD_XDAC0_CKEN_POS (5)
#define SYS_AONP_REGD_XDAC0_CKEN_MASK (0x1)

#define SYS_AONP_REGD_XDAC1_CKEN_POS (6)
#define SYS_AONP_REGD_XDAC1_CKEN_MASK (0x1)

#define SYS_AONP_REGD_AUXS_CKEN_POS (7)
#define SYS_AONP_REGD_AUXS_CKEN_MASK (0x1)

#define SYS_AONP_REGD_AUXS_ENET_CKEN_POS (8)
#define SYS_AONP_REGD_AUXS_ENET_CKEN_MASK (0x1)

#define SYS_AONP_REGD_SIG_26MS_CKEN_POS (9)
#define SYS_AONP_REGD_SIG_26MS_CKEN_MASK (0x1)

#define SYS_AONP_REGD_SIG_32KS_CKEN_POS (10)
#define SYS_AONP_REGD_SIG_32KS_CKEN_MASK (0x1)

#define SYS_AONP_REGD_SIG_26MO_CKEN_POS (11)
#define SYS_AONP_REGD_SIG_26MO_CKEN_MASK (0x1)

#define SYS_AONP_REGD_SIG_240M_CKEN_POS (12)
#define SYS_AONP_REGD_SIG_240M_CKEN_MASK (0x1)

#define SYS_AONP_REGD_SIG_320M_CKEN_POS (13)
#define SYS_AONP_REGD_SIG_320M_CKEN_MASK (0x1)

#define SYS_AONP_REGD_SIG_480M_CKEN_POS (14)
#define SYS_AONP_REGD_SIG_480M_CKEN_MASK (0x1)

#define SYS_AONP_REGD_SIG_160M_CKEN_POS (15)
#define SYS_AONP_REGD_SIG_160M_CKEN_MASK (0x1)

#define SYS_AONP_REGD_SIG_120M_CKEN_POS (16)
#define SYS_AONP_REGD_SIG_120M_CKEN_MASK (0x1)

#define SYS_AONP_REGD_TRACE_CKEN_POS (17)
#define SYS_AONP_REGD_TRACE_CKEN_MASK (0x1)

#define SYS_AONP_REGD_RESERVED_18_21_POS (18)
#define SYS_AONP_REGD_RESERVED_18_21_MASK (0xf)

#define SYS_AONP_REGD_WLSS_CKEN_POS (22)
#define SYS_AONP_REGD_WLSS_CKEN_MASK (0x1)

#define SYS_AONP_REGD_BTDM_CKEN_POS (23)
#define SYS_AONP_REGD_BTDM_CKEN_MASK (0x1)

#define SYS_AONP_REGD_XVER_CKEN_POS (24)
#define SYS_AONP_REGD_XVER_CKEN_MASK (0x1)

#define SYS_AONP_REGD_MAC_CKEN_POS (25)
#define SYS_AONP_REGD_MAC_CKEN_MASK (0x1)

#define SYS_AONP_REGD_PHY_CKEN_POS (26)
#define SYS_AONP_REGD_PHY_CKEN_MASK (0x1)

#define SYS_AONP_REGD_THREAD_CKEN_POS (27)
#define SYS_AONP_REGD_THREAD_CKEN_MASK (0x1)

#define SYS_AONP_REGD_BK24_CKEN_POS (28)
#define SYS_AONP_REGD_BK24_CKEN_MASK (0x1)

#define SYS_AONP_REGD_RF_CKEN_POS (29)
#define SYS_AONP_REGD_RF_CKEN_MASK (0x1)

#define SYS_AONP_REGD_OFDM_CKEN_POS (30)
#define SYS_AONP_REGD_OFDM_CKEN_MASK (0x1)

#define SYS_AONP_REGD_RESERVED_31_31_POS (31)
#define SYS_AONP_REGD_RESERVED_31_31_MASK (0x1)

#define SYS_AONP_REGF_ADDR (SOC_SYS_AONP_REG_BASE + (0xf << 2))

#define SYS_AONP_REGF_RESERVED_0_0_POS (0)
#define SYS_AONP_REGF_RESERVED_0_0_MASK (0x1)

#define SYS_AONP_REGF_RESERVED_1_1_POS (1)
#define SYS_AONP_REGF_RESERVED_1_1_MASK (0x1)

#define SYS_AONP_REGF_RESERVED_2_2_POS (2)
#define SYS_AONP_REGF_RESERVED_2_2_MASK (0x1)

#define SYS_AONP_REGF_MACP_MEM_RET_POS (3)
#define SYS_AONP_REGF_MACP_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_PHYP_MEM_RET_POS (4)
#define SYS_AONP_REGF_PHYP_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_THREAD_MEM_RET_POS (5)
#define SYS_AONP_REGF_THREAD_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_ENCP_MEM_RET_POS (6)
#define SYS_AONP_REGF_ENCP_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_CAN0_MEM_RET_POS (7)
#define SYS_AONP_REGF_CAN0_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_CAN1_MEM_RET_POS (8)
#define SYS_AONP_REGF_CAN1_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_IRDA0_MEM_RET_POS (9)
#define SYS_AONP_REGF_IRDA0_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_IRDA1_MEM_RET_POS (10)
#define SYS_AONP_REGF_IRDA1_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_DMA0_MEM_RET_POS (11)
#define SYS_AONP_REGF_DMA0_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_SPI1_MEM_RET_POS (12)
#define SYS_AONP_REGF_SPI1_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_SPI2_MEM_RET_POS (13)
#define SYS_AONP_REGF_SPI2_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_UART1_MEM_RET_POS (14)
#define SYS_AONP_REGF_UART1_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_UART2_MEM_RET_POS (15)
#define SYS_AONP_REGF_UART2_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_UART3_MEM_RET_POS (16)
#define SYS_AONP_REGF_UART3_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_UART0_MEM_RET_POS (17)
#define SYS_AONP_REGF_UART0_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_SPI0_MEM_RET_POS (18)
#define SYS_AONP_REGF_SPI0_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_FLSH_MEM_RET_POS (19)
#define SYS_AONP_REGF_FLSH_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_AUDP_MEM_RET_POS (20)
#define SYS_AONP_REGF_AUDP_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_I3C_MEM_RET_POS (21)
#define SYS_AONP_REGF_I3C_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_XVR_MEM_RET_POS (22)
#define SYS_AONP_REGF_XVR_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_RESERVED_23_23_POS (23)
#define SYS_AONP_REGF_RESERVED_23_23_MASK (0x1)

#define SYS_AONP_REGF_BK24_MEM_RET_POS (24)
#define SYS_AONP_REGF_BK24_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_IRDA2_MEM_RET_POS (25)
#define SYS_AONP_REGF_IRDA2_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_IRDA3_MEM_RET_POS (26)
#define SYS_AONP_REGF_IRDA3_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_SPI3_MEM_RET_POS (27)
#define SYS_AONP_REGF_SPI3_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_UART4_MEM_RET_POS (28)
#define SYS_AONP_REGF_UART4_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_CPU0_MEM_RET_POS (29)
#define SYS_AONP_REGF_CPU0_MEM_RET_MASK (0x1)

