bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_REGF_CPU1_MEM_RET_POS (30)
#define SYS_AONP_REGF_CPU1_MEM_RET_MASK (0x1)

#define SYS_AONP_REGF_CORESIGHT_MEM_RET_POS (31)
#define SYS_AONP_REGF_CORESIGHT_MEM_RET_MASK (0x1)

#define SYS_AONP_REG10_ADDR (SOC_SYS_AONP_REG_BASE + (0x10 << 2))

#define SYS_AONP_REG10_PWD_CPU1_POS (0)
#define SYS_AONP_REG10_PWD_CPU1_MASK (0x1)

#define SYS_AONP_REG10_PWD_VEHP_POS (1)
#define SYS_AONP_REG10_PWD_VEHP_MASK (0x1)

#define SYS_AONP_REG10_PWD_WRLS_POS (2)
#define SYS_AONP_REG10_PWD_WRLS_MASK (0x1)

#define SYS_AONP_REG10_ROM_PGEN_POS (3)
#define SYS_AONP_REG10_ROM_PGEN_MASK (0x1)

#define SYS_AONP_REG10_CPU1_ISOLATE_STATE_POS (4)
#define SYS_AONP_REG10_CPU1_ISOLATE_STATE_MASK (0x1)

#define SYS_AONP_REG10_VEHP_ISOLATE_STATE_POS (5)
#define SYS_AONP_REG10_VEHP_ISOLATE_STATE_MASK (0x1)

#define SYS_AONP_REG10_WRLS_ISOLATE_STATE_POS (6)
#define SYS_AONP_REG10_WRLS_ISOLATE_STATE_MASK (0x1)

#define SYS_AONP_REG10_RESERVED_7_30_POS (7)
#define SYS_AONP_REG10_RESERVED_7_30_MASK (0xffffff)

#define SYS_AONP_REG10_BUSMATRIX_BUSY_POS (31)
#define SYS_AONP_REG10_BUSMATRIX_BUSY_MASK (0x1)

#define SYS_AONP_REG11_ADDR (SOC_SYS_AONP_REG_BASE + (0x11 << 2))

#define SYS_AONP_REG11_SLEEP_EN_GLOBAL_POS (0)
#define SYS_AONP_REG11_SLEEP_EN_GLOBAL_MASK (0x1)

#define SYS_AONP_REG11_SLEEP_EN_NEED_FLASH_IDLE_POS (1)
#define SYS_AONP_REG11_SLEEP_EN_NEED_FLASH_IDLE_MASK (0x1)

#define SYS_AONP_REG11_SLEEP_BUS_IDLE_BYPASS_POS (2)
#define SYS_AONP_REG11_SLEEP_BUS_IDLE_BYPASS_MASK (0x1)

#define SYS_AONP_REG11_SLEEP_EN_NEED_CPU0_WFI_POS (3)
#define SYS_AONP_REG11_SLEEP_EN_NEED_CPU0_WFI_MASK (0x1)

#define SYS_AONP_REG11_SLEEP_EN_NEED_CPU1_WFI_POS (4)
#define SYS_AONP_REG11_SLEEP_EN_NEED_CPU1_WFI_MASK (0x1)

#define SYS_AONP_REG11_RESERVED_BIT_5_11_POS (5)
#define SYS_AONP_REG11_RESERVED_BIT_5_11_MASK (0x7f)

#define SYS_AONP_REG11_RESERVED_12_15_POS (12)
#define SYS_AONP_REG11_RESERVED_12_15_MASK (0xf)

#define SYS_AONP_REG11_CPU0_TICKTIMER_32K_ENABLE_POS (16)
#define SYS_AONP_REG11_CPU0_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_AONP_REG11_CPU1_TICKTIMER_32K_ENABLE_POS (17)
#define SYS_AONP_REG11_CPU1_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_AONP_REG11_RESERVED_BIT_18_19_POS (18)
#define SYS_AONP_REG11_RESERVED_BIT_18_19_MASK (0x3)

#define SYS_AONP_REG11_RESERVED_20_24_POS (20)
#define SYS_AONP_REG11_RESERVED_20_24_MASK (0x1f)

#define SYS_AONP_REG11_BTS_SOFT_WAKEUP_REQ_POS (25)
#define SYS_AONP_REG11_BTS_SOFT_WAKEUP_REQ_MASK (0x1)

#define SYS_AONP_REG11_ROM_RD_DISABLE_POS (26)
#define SYS_AONP_REG11_ROM_RD_DISABLE_MASK (0x1)

#define SYS_AONP_REG11_OTP_RD_DISABLE_POS (27)
#define SYS_AONP_REG11_OTP_RD_DISABLE_MASK (0x1)

#define SYS_AONP_REG11_SHARE_MEM_CLKGATING_DISABLE_POS (28)
#define SYS_AONP_REG11_SHARE_MEM_CLKGATING_DISABLE_MASK (0x1)

#define SYS_AONP_REG11_RESERVED_29_31_POS (29)
#define SYS_AONP_REG11_RESERVED_29_31_MASK (0x7)

#define SYS_AONP_REG14_ADDR (SOC_SYS_AONP_REG_BASE + (0x14 << 2))

#define SYS_AONP_REG14_CPU0_INTEN_POS (0)
#define SYS_AONP_REG14_CPU0_INTEN_MASK (0xffffffff)

#define SYS_AONP_REG15_ADDR (SOC_SYS_AONP_REG_BASE + (0x15 << 2))

#define SYS_AONP_REG15_CPU0_INTEN_POS (0)
#define SYS_AONP_REG15_CPU0_INTEN_MASK (0xffffffff)

#define SYS_AONP_REG16_ADDR (SOC_SYS_AONP_REG_BASE + (0x16 << 2))

#define SYS_AONP_REG16_CPU0_INTEN_POS (0)
#define SYS_AONP_REG16_CPU0_INTEN_MASK (0xffffffff)

#define SYS_AONP_REG17_ADDR (SOC_SYS_AONP_REG_BASE + (0x17 << 2))

#define SYS_AONP_REG17_CPU1_INTEN_POS (0)
#define SYS_AONP_REG17_CPU1_INTEN_MASK (0xffffffff)

#define SYS_AONP_REG18_ADDR (SOC_SYS_AONP_REG_BASE + (0x18 << 2))

#define SYS_AONP_REG18_CPU1_INTEN_POS (0)
#define SYS_AONP_REG18_CPU1_INTEN_MASK (0xffffffff)

#define SYS_AONP_REG19_ADDR (SOC_SYS_AONP_REG_BASE + (0x19 << 2))

#define SYS_AONP_REG19_CPU1_INTEN_POS (0)
#define SYS_AONP_REG19_CPU1_INTEN_MASK (0xffffffff)

#define SYS_AONP_REG1A_ADDR (SOC_SYS_AONP_REG_BASE + (0x1a << 2))

#define SYS_AONP_REG1A_M55SUB_INTEN_POS (0)
#define SYS_AONP_REG1A_M55SUB_INTEN_MASK (0xffffffff)

#define SYS_AONP_REG1B_ADDR (SOC_SYS_AONP_REG_BASE + (0x1b << 2))

#define SYS_AONP_REG1B_M55SUB_INTEN_POS (0)
#define SYS_AONP_REG1B_M55SUB_INTEN_MASK (0xffffffff)

#define SYS_AONP_REG1C_ADDR (SOC_SYS_AONP_REG_BASE + (0x1c << 2))

#define SYS_AONP_REG1C_M55SUB_INTEN_POS (0)
#define SYS_AONP_REG1C_M55SUB_INTEN_MASK (0x7fffffff)

#define SYS_AONP_REG1C_M55SUB_WAKEUP_POS (31)
#define SYS_AONP_REG1C_M55SUB_WAKEUP_MASK (0x1)

#define SYS_AONP_REG1E_ADDR (SOC_SYS_AONP_REG_BASE + (0x1e << 2))

#define SYS_AONP_REG1E_SPSH_CFG_POS (0)
#define SYS_AONP_REG1E_SPSH_CFG_MASK (0x3ff)

#define SYS_AONP_REG1E_SPBH_CFG_POS (10)
#define SYS_AONP_REG1E_SPBH_CFG_MASK (0x7ff)

#define SYS_AONP_REG1E_RESERVED_BIT_21_23_POS (21)
#define SYS_AONP_REG1E_RESERVED_BIT_21_23_MASK (0x7)

#define SYS_AONP_REG1E_SET_KEY_POS (24)
#define SYS_AONP_REG1E_SET_KEY_MASK (0xff)

#define SYS_AONP_REG1F_ADDR (SOC_SYS_AONP_REG_BASE + (0x1f << 2))

#define SYS_AONP_REG1F_STPH_CFG_POS (0)
#define SYS_AONP_REG1F_STPH_CFG_MASK (0xfff)

#define SYS_AONP_REG1F_RESERVED_BIT_12_23_POS (12)
#define SYS_AONP_REG1F_RESERVED_BIT_12_23_MASK (0xfff)

#define SYS_AONP_REG1F_SET_KEY_POS (24)
#define SYS_AONP_REG1F_SET_KEY_MASK (0xff)

#define SYS_AONP_REG20_ADDR (SOC_SYS_AONP_REG_BASE + (0x20 << 2))

#define SYS_AONP_REG20_INTS_STATUS0_POS (0)
#define SYS_AONP_REG20_INTS_STATUS0_MASK (0xffffffff)

#define SYS_AONP_REG21_ADDR (SOC_SYS_AONP_REG_BASE + (0x21 << 2))

#define SYS_AONP_REG21_INTS_STATUS1_POS (0)
#define SYS_AONP_REG21_INTS_STATUS1_MASK (0xffffffff)

#define SYS_AONP_REG22_ADDR (SOC_SYS_AONP_REG_BASE + (0x22 << 2))

#define SYS_AONP_REG22_INTS_STATUS2_POS (0)
#define SYS_AONP_REG22_INTS_STATUS2_MASK (0xffffffff)

#define SYS_AONP_REG23_ADDR (SOC_SYS_AONP_REG_BASE + (0x23 << 2))

#define SYS_AONP_REG23_INTS_STATUS3_POS (0)
#define SYS_AONP_REG23_INTS_STATUS3_MASK (0xffffffff)

