bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_REG24_ADDR (SOC_SYS_AONP_REG_BASE + (0x24 << 2))

#define SYS_AONP_REG24_INTS_STATUS4_POS (0)
#define SYS_AONP_REG24_INTS_STATUS4_MASK (0xffffffff)

#define SYS_AONP_REG25_ADDR (SOC_SYS_AONP_REG_BASE + (0x25 << 2))

#define SYS_AONP_REG25_INTS_STATUS5_POS (0)
#define SYS_AONP_REG25_INTS_STATUS5_MASK (0xffffffff)

#define SYS_AONP_REG26_ADDR (SOC_SYS_AONP_REG_BASE + (0x26 << 2))

#define SYS_AONP_REG26_M55SUB_STATUS0_POS (0)
#define SYS_AONP_REG26_M55SUB_STATUS0_MASK (0xffffffff)

#define SYS_AONP_REG27_ADDR (SOC_SYS_AONP_REG_BASE + (0x27 << 2))

#define SYS_AONP_REG27_M55SUB_STATUS1_POS (0)
#define SYS_AONP_REG27_M55SUB_STATUS1_MASK (0xffffffff)

#define SYS_AONP_REG28_ADDR (SOC_SYS_AONP_REG_BASE + (0x28 << 2))

#define SYS_AONP_REG28_M55SUB_STATUS2_POS (0)
#define SYS_AONP_REG28_M55SUB_STATUS2_MASK (0xffffffff)

#define SYS_AONP_REG2A_ADDR (SOC_SYS_AONP_REG_BASE + (0x2a << 2))

#define SYS_AONP_REG2A_DEBUG_GPIO_IE_POS (0)
#define SYS_AONP_REG2A_DEBUG_GPIO_IE_MASK (0xffffffff)

#define SYS_AONP_REG2B_ADDR (SOC_SYS_AONP_REG_BASE + (0x2b << 2))

#define SYS_AONP_REG2B_DEBUG_GPIO_I_POS (0)
#define SYS_AONP_REG2B_DEBUG_GPIO_I_MASK (0xffffffff)

#define SYS_AONP_REG2C_ADDR (SOC_SYS_AONP_REG_BASE + (0x2c << 2))

#define SYS_AONP_REG2C_CACHE_CLEAN_MODE_POS (0)
#define SYS_AONP_REG2C_CACHE_CLEAN_MODE_MASK (0x1)

#define SYS_AONP_REG2C_CPU0_ICACHE_CLEAN_MODE_POS (1)
#define SYS_AONP_REG2C_CPU0_ICACHE_CLEAN_MODE_MASK (0x1)

#define SYS_AONP_REG2C_CPU0_ICACHE_CLEAN_TAG_SEL_POS (2)
#define SYS_AONP_REG2C_CPU0_ICACHE_CLEAN_TAG_SEL_MASK (0x1)

#define SYS_AONP_REG2C_L2_CACHE_CLEAN_MODE_POS (3)
#define SYS_AONP_REG2C_L2_CACHE_CLEAN_MODE_MASK (0x1)

#define SYS_AONP_REG2C_L2_CACHE_CLEAN_TAG_SEL_POS (4)
#define SYS_AONP_REG2C_L2_CACHE_CLEAN_TAG_SEL_MASK (0x3)

#define SYS_AONP_REG2C_RESERVED_6_23_POS (6)
#define SYS_AONP_REG2C_RESERVED_6_23_MASK (0x3ffff)

#define SYS_AONP_REG2C_SET_KEY_POS (24)
#define SYS_AONP_REG2C_SET_KEY_MASK (0xff)

#define SYS_AONP_REG2E_ADDR (SOC_SYS_AONP_REG_BASE + (0x2e << 2))

#define SYS_AONP_REG2E_SPSL_CFG_POS (0)
#define SYS_AONP_REG2E_SPSL_CFG_MASK (0x3ff)

#define SYS_AONP_REG2E_SPBL_CFG_POS (10)
#define SYS_AONP_REG2E_SPBL_CFG_MASK (0x7ff)

#define SYS_AONP_REG2E_RESERVED_BIT_21_23_POS (21)
#define SYS_AONP_REG2E_RESERVED_BIT_21_23_MASK (0x7)

#define SYS_AONP_REG2E_SET_KEY_POS (24)
#define SYS_AONP_REG2E_SET_KEY_MASK (0xff)

#define SYS_AONP_REG2F_ADDR (SOC_SYS_AONP_REG_BASE + (0x2f << 2))

#define SYS_AONP_REG2F_STPL_CFG_POS (0)
#define SYS_AONP_REG2F_STPL_CFG_MASK (0xfff)

#define SYS_AONP_REG2F_RESERVED_BIT_12_23_POS (12)
#define SYS_AONP_REG2F_RESERVED_BIT_12_23_MASK (0xfff)

#define SYS_AONP_REG2F_SET_KEY_POS (24)
#define SYS_AONP_REG2F_SET_KEY_MASK (0xff)

#define SYS_AONP_REG30_ADDR (SOC_SYS_AONP_REG_BASE + (0x30 << 2))

#define SYS_AONP_REG30_GPIO_INPUT_STATUS0_POS (0)
#define SYS_AONP_REG30_GPIO_INPUT_STATUS0_MASK (0xffffffff)

#define SYS_AONP_REG31_ADDR (SOC_SYS_AONP_REG_BASE + (0x31 << 2))

#define SYS_AONP_REG31_GPIO_INPUT_STATUS1_POS (0)
#define SYS_AONP_REG31_GPIO_INPUT_STATUS1_MASK (0xffffffff)

#define SYS_AONP_REG32_ADDR (SOC_SYS_AONP_REG_BASE + (0x32 << 2))

#define SYS_AONP_REG32_GPIO_INPUT_STATUS2_POS (0)
#define SYS_AONP_REG32_GPIO_INPUT_STATUS2_MASK (0xff)

#define SYS_AONP_REG32_RESERVED_BIT_8_30_POS (8)
#define SYS_AONP_REG32_RESERVED_BIT_8_30_MASK (0x7fffff)

#define SYS_AONP_REG32_GPIO_INPUT_STATUS_EN_POS (31)
#define SYS_AONP_REG32_GPIO_INPUT_STATUS_EN_MASK (0x1)

#define SYS_AONP_REG33_ADDR (SOC_SYS_AONP_REG_BASE + (0x33 << 2))

#define SYS_AONP_REG33_ACOMP0_PWM0_SAMPLE_EN_POS (0)
#define SYS_AONP_REG33_ACOMP0_PWM0_SAMPLE_EN_MASK (0x1)

#define SYS_AONP_REG33_ACOMP1_PWM0_SAMPLE_EN_POS (1)
#define SYS_AONP_REG33_ACOMP1_PWM0_SAMPLE_EN_MASK (0x1)

#define SYS_AONP_REG33_RESERVED_2_15_POS (2)
#define SYS_AONP_REG33_RESERVED_2_15_MASK (0x3fff)

#define SYS_AONP_REG33_L2_DIS_PWR_DOWN_MAINT_POS (16)
#define SYS_AONP_REG33_L2_DIS_PWR_DOWN_MAINT_MASK (0x1)

#define SYS_AONP_REG33_L2_APB_VIOLATION_RESP_POS (17)
#define SYS_AONP_REG33_L2_APB_VIOLATION_RESP_MASK (0x1)

#define SYS_AONP_REG33_CPU0_DBGEN_L2_RST_DIS_POS (18)
#define SYS_AONP_REG33_CPU0_DBGEN_L2_RST_DIS_MASK (0x1)

#define SYS_AONP_REG33_CPU1_DBGEN_L2_RST_DIS_POS (19)
#define SYS_AONP_REG33_CPU1_DBGEN_L2_RST_DIS_MASK (0x1)

#define SYS_AONP_REG33_RESERVED_20_23_POS (20)
#define SYS_AONP_REG33_RESERVED_20_23_MASK (0xf)

#define SYS_AONP_REG33_CPU0_WFE_SRC_POS (24)
#define SYS_AONP_REG33_CPU0_WFE_SRC_MASK (0x1)

#define SYS_AONP_REG33_CPU0_WFE_PULSE_POS (25)
#define SYS_AONP_REG33_CPU0_WFE_PULSE_MASK (0x1)

#define SYS_AONP_REG33_CPU1_WFE_SRC_POS (26)
#define SYS_AONP_REG33_CPU1_WFE_SRC_MASK (0x1)

#define SYS_AONP_REG33_CPU1_WFE_PULSE_POS (27)
#define SYS_AONP_REG33_CPU1_WFE_PULSE_MASK (0x1)

#define SYS_AONP_REG33_CPU0_SLEEPING_STATE_POS (28)
#define SYS_AONP_REG33_CPU0_SLEEPING_STATE_MASK (0x1)

#define SYS_AONP_REG33_CPU0_DEEPSLEEP_STATE_POS (29)
#define SYS_AONP_REG33_CPU0_DEEPSLEEP_STATE_MASK (0x1)

#define SYS_AONP_REG33_CPU1_SLEEPING_STATE_POS (30)
#define SYS_AONP_REG33_CPU1_SLEEPING_STATE_MASK (0x1)

#define SYS_AONP_REG33_CPU1_DEEPSLEEP_STATE_POS (31)
#define SYS_AONP_REG33_CPU1_DEEPSLEEP_STATE_MASK (0x1)

#define SYS_AONP_REG34_ADDR (SOC_SYS_AONP_REG_BASE + (0x34 << 2))

#define SYS_AONP_REG34_CPU0_CURPC_POS (0)
#define SYS_AONP_REG34_CPU0_CURPC_MASK (0xffffffff)

#define SYS_AONP_REG35_ADDR (SOC_SYS_AONP_REG_BASE + (0x35 << 2))

#define SYS_AONP_REG35_CPU0_FAULTSTAT_H_POS (0)
#define SYS_AONP_REG35_CPU0_FAULTSTAT_H_MASK (0x7ff)

#define SYS_AONP_REG35_RESERVED_11_31_POS (11)
#define SYS_AONP_REG35_RESERVED_11_31_MASK (0x1fffff)

#define SYS_AONP_REG36_ADDR (SOC_SYS_AONP_REG_BASE + (0x36 << 2))

#define SYS_AONP_REG36_CPU0_FAULTSTAT_L_POS (0)
#define SYS_AONP_REG36_CPU0_FAULTSTAT_L_MASK (0xffffffff)

#define SYS_AONP_REG37_ADDR (SOC_SYS_AONP_REG_BASE + (0x37 << 2))

