bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_REG37_CPU0_INTNUM_POS (0)
#define SYS_AONP_REG37_CPU0_INTNUM_MASK (0x1ff)

#define SYS_AONP_REG37_CPU0_CURRPRI_POS (9)
#define SYS_AONP_REG37_CPU0_CURRPRI_MASK (0xff)

#define SYS_AONP_REG37_CPU0_CURRNS_POS (17)
#define SYS_AONP_REG37_CPU0_CURRNS_MASK (0x1)

#define SYS_AONP_REG37_CPU0_HALTED_POS (18)
#define SYS_AONP_REG37_CPU0_HALTED_MASK (0x1)

#define SYS_AONP_REG37_CPU0_NC_HREADY_POS (19)
#define SYS_AONP_REG37_CPU0_NC_HREADY_MASK (0x1)

#define SYS_AONP_REG37_CPU_CACHE_M_HREADY_POS (20)
#define SYS_AONP_REG37_CPU_CACHE_M_HREADY_MASK (0x1)

#define SYS_AONP_REG37_CPU0_RESETN_POS (21)
#define SYS_AONP_REG37_CPU0_RESETN_MASK (0x1)

#define SYS_AONP_REG37_RESERVED_22_31_POS (22)
#define SYS_AONP_REG37_RESERVED_22_31_MASK (0x3ff)

#define SYS_AONP_REG38_ADDR (SOC_SYS_AONP_REG_BASE + (0x38 << 2))

#define SYS_AONP_REG38_DBUG_CONFIG0_POS (0)
#define SYS_AONP_REG38_DBUG_CONFIG0_MASK (0xffffffff)

#define SYS_AONP_REG39_ADDR (SOC_SYS_AONP_REG_BASE + (0x39 << 2))

#define SYS_AONP_REG39_DBUG_CONFIG1_POS (0)
#define SYS_AONP_REG39_DBUG_CONFIG1_MASK (0xffffffff)

#define SYS_AONP_REG3A_ADDR (SOC_SYS_AONP_REG_BASE + (0x3a << 2))

#define SYS_AONP_REG3A_ANAREG_STAT_POS (0)
#define SYS_AONP_REG3A_ANAREG_STAT_MASK (0xffffffff)

#define SYS_AONP_REG3B_ADDR (SOC_SYS_AONP_REG_BASE + (0x3b << 2))

#define SYS_AONP_REG3B_CORESIGHT_CHN_GATE_EN_POS (0)
#define SYS_AONP_REG3B_CORESIGHT_CHN_GATE_EN_MASK (0xffffff)

#define SYS_AONP_REG3B_CORESIGHT_TPMAXDATASIZE_POS (24)
#define SYS_AONP_REG3B_CORESIGHT_TPMAXDATASIZE_MASK (0x1f)

#define SYS_AONP_REG3B_CORESIGHT_VALID_POS (29)
#define SYS_AONP_REG3B_CORESIGHT_VALID_MASK (0x1)

#define SYS_AONP_REG3B_RESERVED_30_30_POS (30)
#define SYS_AONP_REG3B_RESERVED_30_30_MASK (0x1)

#define SYS_AONP_REG3B_ANAREGB_STAT_POS (31)
#define SYS_AONP_REG3B_ANAREGB_STAT_MASK (0x1)

#define SYS_AONP_REG3C_ADDR (SOC_SYS_AONP_REG_BASE + (0x3c << 2))

#define SYS_AONP_REG3C_CPU1_CURPC_POS (0)
#define SYS_AONP_REG3C_CPU1_CURPC_MASK (0xffffffff)

#define SYS_AONP_REG3D_ADDR (SOC_SYS_AONP_REG_BASE + (0x3d << 2))

#define SYS_AONP_REG3D_CPU1_FAULTSTAT_H_POS (0)
#define SYS_AONP_REG3D_CPU1_FAULTSTAT_H_MASK (0x7ff)

#define SYS_AONP_REG3D_RESERVED_11_31_POS (11)
#define SYS_AONP_REG3D_RESERVED_11_31_MASK (0x1fffff)

#define SYS_AONP_REG3E_ADDR (SOC_SYS_AONP_REG_BASE + (0x3e << 2))

#define SYS_AONP_REG3E_CPU1_FAULTSTAT_L_POS (0)
#define SYS_AONP_REG3E_CPU1_FAULTSTAT_L_MASK (0xffffffff)

#define SYS_AONP_REG3F_ADDR (SOC_SYS_AONP_REG_BASE + (0x3f << 2))

#define SYS_AONP_REG3F_CPU1_INTNUM_POS (0)
#define SYS_AONP_REG3F_CPU1_INTNUM_MASK (0x1ff)

#define SYS_AONP_REG3F_CPU1_CURRPRI_POS (9)
#define SYS_AONP_REG3F_CPU1_CURRPRI_MASK (0xff)

#define SYS_AONP_REG3F_CPU1_CURRNS_POS (17)
#define SYS_AONP_REG3F_CPU1_CURRNS_MASK (0x1)

#define SYS_AONP_REG3F_CPU1_HALTED_POS (18)
#define SYS_AONP_REG3F_CPU1_HALTED_MASK (0x1)

#define SYS_AONP_REG3F_CPU1_NC_HREADY_POS (19)
#define SYS_AONP_REG3F_CPU1_NC_HREADY_MASK (0x1)

#define SYS_AONP_REG3F_RESERVED_20_20_POS (20)
#define SYS_AONP_REG3F_RESERVED_20_20_MASK (0x1)

#define SYS_AONP_REG3F_CPU1_RESETN_POS (21)
#define SYS_AONP_REG3F_CPU1_RESETN_MASK (0x1)

#define SYS_AONP_REG3F_RESERVED_22_31_POS (22)
#define SYS_AONP_REG3F_RESERVED_22_31_MASK (0x3ff)

#define SYS_AONP_ANA_REG0_ADDR (SOC_SYS_AONP_REG_BASE + (0x40 << 2))

#define SYS_AONP_ANA_REG0_DPLL_TSTEN_POS (0)
#define SYS_AONP_ANA_REG0_DPLL_TSTEN_MASK (0x1)

#define SYS_AONP_ANA_REG0_CP_POS (1)
#define SYS_AONP_ANA_REG0_CP_MASK (0x7)

#define SYS_AONP_ANA_REG0_SPIDETEN_POS (4)
#define SYS_AONP_ANA_REG0_SPIDETEN_MASK (0x1)

#define SYS_AONP_ANA_REG0_HVREF_POS (5)
#define SYS_AONP_ANA_REG0_HVREF_MASK (0x3)

#define SYS_AONP_ANA_REG0_LVREF_POS (7)
#define SYS_AONP_ANA_REG0_LVREF_MASK (0x3)

#define SYS_AONP_ANA_REG0_RZCTRL26M_POS (9)
#define SYS_AONP_ANA_REG0_RZCTRL26M_MASK (0x1)

#define SYS_AONP_ANA_REG0_LOOPRZCTRL_POS (10)
#define SYS_AONP_ANA_REG0_LOOPRZCTRL_MASK (0xf)

#define SYS_AONP_ANA_REG0_RPC_POS (14)
#define SYS_AONP_ANA_REG0_RPC_MASK (0x3)

#define SYS_AONP_ANA_REG0_OPENLOOP_EN_POS (16)
#define SYS_AONP_ANA_REG0_OPENLOOP_EN_MASK (0x1)

#define SYS_AONP_ANA_REG0_CKSEL_POS (17)
#define SYS_AONP_ANA_REG0_CKSEL_MASK (0x3)

#define SYS_AONP_ANA_REG0_SPITRIG_POS (19)
#define SYS_AONP_ANA_REG0_SPITRIG_MASK (0x1)

#define SYS_AONP_ANA_REG0_BAND_POS (20)
#define SYS_AONP_ANA_REG0_BAND_MASK (0x1)

#define SYS_AONP_ANA_REG0_BAND_1_POS (21)
#define SYS_AONP_ANA_REG0_BAND_1_MASK (0x1)

#define SYS_AONP_ANA_REG0_BAND_2_POS (22)
#define SYS_AONP_ANA_REG0_BAND_2_MASK (0x7)

#define SYS_AONP_ANA_REG0_BANDMANUAL_POS (25)
#define SYS_AONP_ANA_REG0_BANDMANUAL_MASK (0x1)

#define SYS_AONP_ANA_REG0_DSPTRIG_POS (26)
#define SYS_AONP_ANA_REG0_DSPTRIG_MASK (0x1)

#define SYS_AONP_ANA_REG0_LPEN_DPLL_POS (27)
#define SYS_AONP_ANA_REG0_LPEN_DPLL_MASK (0x1)

#define SYS_AONP_ANA_REG0_NC_28_29_POS (28)
#define SYS_AONP_ANA_REG0_NC_28_29_MASK (0x3)

#define SYS_AONP_ANA_REG0_BP_CALDONE_POS (30)
#define SYS_AONP_ANA_REG0_BP_CALDONE_MASK (0x1)

#define SYS_AONP_ANA_REG0_VCTRL_DPLLLDO_POS (31)
#define SYS_AONP_ANA_REG0_VCTRL_DPLLLDO_MASK (0x1)

#define SYS_AONP_ANA_REG1_ADDR (SOC_SYS_AONP_REG_BASE + (0x41 << 2))

#define SYS_AONP_ANA_REG1_VCOOFFSET_POS (0)
#define SYS_AONP_ANA_REG1_VCOOFFSET_MASK (0x1)

#define SYS_AONP_ANA_REG1_SELPOL_POS (1)
#define SYS_AONP_ANA_REG1_SELPOL_MASK (0x1)

#define SYS_AONP_ANA_REG1_DLYSEL_POS (2)
#define SYS_AONP_ANA_REG1_DLYSEL_MASK (0x3)

#define SYS_AONP_ANA_REG1_EDGESEL_NCK_POS (4)
#define SYS_AONP_ANA_REG1_EDGESEL_NCK_MASK (0x1)

#define SYS_AONP_ANA_REG1_NLOAD_DLYEN_POS (5)
#define SYS_AONP_ANA_REG1_NLOAD_DLYEN_MASK (0x1)

#define SYS_AONP_ANA_REG1_CP_POS (6)
#define SYS_AONP_ANA_REG1_CP_MASK (0x7)

#define SYS_AONP_ANA_REG1_SPIDETEN_POS (9)
#define SYS_AONP_ANA_REG1_SPIDETEN_MASK (0x1)

#define SYS_AONP_ANA_REG1_CBEN_POS (10)
#define SYS_AONP_ANA_REG1_CBEN_MASK (0x1)

#define SYS_AONP_ANA_REG1_HVREF_POS (11)
#define SYS_AONP_ANA_REG1_HVREF_MASK (0x3)

#define SYS_AONP_ANA_REG1_LVREF_POS (13)
#define SYS_AONP_ANA_REG1_LVREF_MASK (0x3)

#define SYS_AONP_ANA_REG1_RZCTRL26M_POS (15)
#define SYS_AONP_ANA_REG1_RZCTRL26M_MASK (0x1)

#define SYS_AONP_ANA_REG1_LPFRZ_POS (16)
#define SYS_AONP_ANA_REG1_LPFRZ_MASK (0xf)

#define SYS_AONP_ANA_REG1_RPC_POS (20)
#define SYS_AONP_ANA_REG1_RPC_MASK (0x7)

#define SYS_AONP_ANA_REG1_DPLL_TSTEN_POS (23)
#define SYS_AONP_ANA_REG1_DPLL_TSTEN_MASK (0x1)

#define SYS_AONP_ANA_REG1_KCTRL_POS (24)
#define SYS_AONP_ANA_REG1_KCTRL_MASK (0x3)

#define SYS_AONP_ANA_REG1_VSEL_LDO_POS (26)
#define SYS_AONP_ANA_REG1_VSEL_LDO_MASK (0x3)

#define SYS_AONP_ANA_REG1_DIV_SW_POS (28)
#define SYS_AONP_ANA_REG1_DIV_SW_MASK (0x1)

#define SYS_AONP_ANA_REG1_BP_CALDONE_POS (29)
#define SYS_AONP_ANA_REG1_BP_CALDONE_MASK (0x1)

#define SYS_AONP_ANA_REG1_CK2XEN_POS (30)
#define SYS_AONP_ANA_REG1_CK2XEN_MASK (0x1)

#define SYS_AONP_ANA_REG1_INT_MOD_POS (31)
#define SYS_AONP_ANA_REG1_INT_MOD_MASK (0x1)

#define SYS_AONP_ANA_REG2_ADDR (SOC_SYS_AONP_REG_BASE + (0x42 << 2))

