bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_ANA_REG2_XTALH_CTUNE_POS (0)
#define SYS_AONP_ANA_REG2_XTALH_CTUNE_MASK (0xff)

#define SYS_AONP_ANA_REG2_FORCE_26MPLL_POS (8)
#define SYS_AONP_ANA_REG2_FORCE_26MPLL_MASK (0x1)

#define SYS_AONP_ANA_REG2_NC_9_11_POS (9)
#define SYS_AONP_ANA_REG2_NC_9_11_MASK (0x7)

#define SYS_AONP_ANA_REG2_GADC_SD1V_POS (12)
#define SYS_AONP_ANA_REG2_GADC_SD1V_MASK (0x1)

#define SYS_AONP_ANA_REG2_GADC_BSCALSAW_POS (13)
#define SYS_AONP_ANA_REG2_GADC_BSCALSAW_MASK (0x7)

#define SYS_AONP_ANA_REG2_GADC_VNCALSAW_POS (16)
#define SYS_AONP_ANA_REG2_GADC_VNCALSAW_MASK (0x7)

#define SYS_AONP_ANA_REG2_GADC_VPCALSAW_POS (19)
#define SYS_AONP_ANA_REG2_GADC_VPCALSAW_MASK (0x7)

#define SYS_AONP_ANA_REG2_NC_22_22_POS (22)
#define SYS_AONP_ANA_REG2_NC_22_22_MASK (0x1)

#define SYS_AONP_ANA_REG2_GADC_VBG_SEL_POS (23)
#define SYS_AONP_ANA_REG2_GADC_VBG_SEL_MASK (0x1)

#define SYS_AONP_ANA_REG2_GADC_CLK_RLTEN_POS (24)
#define SYS_AONP_ANA_REG2_GADC_CLK_RLTEN_MASK (0x1)

#define SYS_AONP_ANA_REG2_GADC_CALINTSAW_EN_POS (25)
#define SYS_AONP_ANA_REG2_GADC_CALINTSAW_EN_MASK (0x1)

#define SYS_AONP_ANA_REG2_GADC_CLK_SEL_POS (26)
#define SYS_AONP_ANA_REG2_GADC_CLK_SEL_MASK (0x1)

#define SYS_AONP_ANA_REG2_GADC_CLK_INV_POS (27)
#define SYS_AONP_ANA_REG2_GADC_CLK_INV_MASK (0x1)

#define SYS_AONP_ANA_REG2_GADC_CALCAP_CH_POS (28)
#define SYS_AONP_ANA_REG2_GADC_CALCAP_CH_MASK (0x3)

#define SYS_AONP_ANA_REG2_GADC_INBUF_EN_POS (30)
#define SYS_AONP_ANA_REG2_GADC_INBUF_EN_MASK (0x1)

#define SYS_AONP_ANA_REG2_GADC_EN_SPI_POS (31)
#define SYS_AONP_ANA_REG2_GADC_EN_SPI_MASK (0x1)

#define SYS_AONP_ANA_REG3_ADDR (SOC_SYS_AONP_REG_BASE + (0x43 << 2))

#define SYS_AONP_ANA_REG3_NC_0_6_POS (0)
#define SYS_AONP_ANA_REG3_NC_0_6_MASK (0x7f)

#define SYS_AONP_ANA_REG3_ANABUF_SEL_RX_POS (7)
#define SYS_AONP_ANA_REG3_ANABUF_SEL_RX_MASK (0x1)

#define SYS_AONP_ANA_REG3_HPSSREN_POS (8)
#define SYS_AONP_ANA_REG3_HPSSREN_MASK (0x1)

#define SYS_AONP_ANA_REG3_CK_SEL_POS (9)
#define SYS_AONP_ANA_REG3_CK_SEL_MASK (0x1)

#define SYS_AONP_ANA_REG3_ANABUF_SEL_TX_POS (10)
#define SYS_AONP_ANA_REG3_ANABUF_SEL_TX_MASK (0x1)

#define SYS_AONP_ANA_REG3_PWD_XTALLDO_POS (11)
#define SYS_AONP_ANA_REG3_PWD_XTALLDO_MASK (0x1)

#define SYS_AONP_ANA_REG3_IAMP_POS (12)
#define SYS_AONP_ANA_REG3_IAMP_MASK (0x1)

#define SYS_AONP_ANA_REG3_VDDREN_POS (13)
#define SYS_AONP_ANA_REG3_VDDREN_MASK (0x1)

#define SYS_AONP_ANA_REG3_XAMP_POS (14)
#define SYS_AONP_ANA_REG3_XAMP_MASK (0x3f)

#define SYS_AONP_ANA_REG3_VOSEL_POS (20)
#define SYS_AONP_ANA_REG3_VOSEL_MASK (0x1f)

#define SYS_AONP_ANA_REG3_EN_XTALH_SLEEP_POS (25)
#define SYS_AONP_ANA_REG3_EN_XTALH_SLEEP_MASK (0x1)

#define SYS_AONP_ANA_REG3_XTAL40_EN_POS (26)
#define SYS_AONP_ANA_REG3_XTAL40_EN_MASK (0x1)

#define SYS_AONP_ANA_REG3_BUFICTRL_POS (27)
#define SYS_AONP_ANA_REG3_BUFICTRL_MASK (0x1)

#define SYS_AONP_ANA_REG3_IBIAS_CTRL_POS (28)
#define SYS_AONP_ANA_REG3_IBIAS_CTRL_MASK (0x3)

#define SYS_AONP_ANA_REG3_ICORE_CTRL_POS (30)
#define SYS_AONP_ANA_REG3_ICORE_CTRL_MASK (0x3)

#define SYS_AONP_ANA_REG4_ADDR (SOC_SYS_AONP_REG_BASE + (0x44 << 2))

#define SYS_AONP_ANA_REG4_CKTST_SEL_POS (0)
#define SYS_AONP_ANA_REG4_CKTST_SEL_MASK (0x3)

#define SYS_AONP_ANA_REG4_CK_TST_EN_POS (2)
#define SYS_AONP_ANA_REG4_CK_TST_EN_MASK (0x1)

#define SYS_AONP_ANA_REG4_VUSBSEL_POS (3)
#define SYS_AONP_ANA_REG4_VUSBSEL_MASK (0x3)

#define SYS_AONP_ANA_REG4_NC_5_16_POS (5)
#define SYS_AONP_ANA_REG4_NC_5_16_MASK (0xfff)

#define SYS_AONP_ANA_REG4_GADC_INBUFF_ISEL_POS (17)
#define SYS_AONP_ANA_REG4_GADC_INBUFF_ISEL_MASK (0x7)

#define SYS_AONP_ANA_REG4_GADC_BIASAMP_ISEL_POS (20)
#define SYS_AONP_ANA_REG4_GADC_BIASAMP_ISEL_MASK (0x7)

#define SYS_AONP_ANA_REG4_GADC_COMP_ISEL_POS (23)
#define SYS_AONP_ANA_REG4_GADC_COMP_ISEL_MASK (0x7)

#define SYS_AONP_ANA_REG4_GADC_PREAMP_ISEL_POS (26)
#define SYS_AONP_ANA_REG4_GADC_PREAMP_ISEL_MASK (0x7)

#define SYS_AONP_ANA_REG4_GADC_BUFAMP_ISEL_POS (29)
#define SYS_AONP_ANA_REG4_GADC_BUFAMP_ISEL_MASK (0x7)

#define SYS_AONP_ANA_REG5_ADDR (SOC_SYS_AONP_REG_BASE + (0x45 << 2))

#define SYS_AONP_ANA_REG5_EN_VOUT_POS (0)
#define SYS_AONP_ANA_REG5_EN_VOUT_MASK (0x1)

#define SYS_AONP_ANA_REG5_EN_XTALL_POS (1)
#define SYS_AONP_ANA_REG5_EN_XTALL_MASK (0x1)

#define SYS_AONP_ANA_REG5_EN_DCO_POS (2)
#define SYS_AONP_ANA_REG5_EN_DCO_MASK (0x1)

#define SYS_AONP_ANA_REG5_NC_3_3_POS (3)
#define SYS_AONP_ANA_REG5_NC_3_3_MASK (0x1)

#define SYS_AONP_ANA_REG5_EN_TEMP_POS (4)
#define SYS_AONP_ANA_REG5_EN_TEMP_MASK (0x1)

#define SYS_AONP_ANA_REG5_EN_DPLL_POS (5)
#define SYS_AONP_ANA_REG5_EN_DPLL_MASK (0x1)

#define SYS_AONP_ANA_REG5_EN_CB_POS (6)
#define SYS_AONP_ANA_REG5_EN_CB_MASK (0x1)

#define SYS_AONP_ANA_REG5_GPIO_LATCH_POS (7)
#define SYS_AONP_ANA_REG5_GPIO_LATCH_MASK (0x1)

#define SYS_AONP_ANA_REG5_NC_8_11_POS (8)
#define SYS_AONP_ANA_REG5_NC_8_11_MASK (0xf)

#define SYS_AONP_ANA_REG5_ROSC_DISABLE_POS (12)
#define SYS_AONP_ANA_REG5_ROSC_DISABLE_MASK (0x1)

#define SYS_AONP_ANA_REG5_PWDAUDPLL_POS (13)
#define SYS_AONP_ANA_REG5_PWDAUDPLL_MASK (0x1)

#define SYS_AONP_ANA_REG5_PWD_ROSC_SPI_POS (14)
#define SYS_AONP_ANA_REG5_PWD_ROSC_SPI_MASK (0x1)

#define SYS_AONP_ANA_REG5_NC_15_15_POS (15)
#define SYS_AONP_ANA_REG5_NC_15_15_MASK (0x1)

#define SYS_AONP_ANA_REG5_ITUNE_XTALL_POS (16)
#define SYS_AONP_ANA_REG5_ITUNE_XTALL_MASK (0xf)

#define SYS_AONP_ANA_REG5_XTALL_TEN_POS (20)
#define SYS_AONP_ANA_REG5_XTALL_TEN_MASK (0x1)

#define SYS_AONP_ANA_REG5_ROSC_TSTEN_POS (21)
#define SYS_AONP_ANA_REG5_ROSC_TSTEN_MASK (0x1)

#define SYS_AONP_ANA_REG5_BCAL_START_POS (22)
#define SYS_AONP_ANA_REG5_BCAL_START_MASK (0x1)

#define SYS_AONP_ANA_REG5_BCAL_EN_POS (23)
#define SYS_AONP_ANA_REG5_BCAL_EN_MASK (0x1)

#define SYS_AONP_ANA_REG5_BCAL_SEL_POS (24)
#define SYS_AONP_ANA_REG5_BCAL_SEL_MASK (0x7)

#define SYS_AONP_ANA_REG5_VBIAS_POS (27)
#define SYS_AONP_ANA_REG5_VBIAS_MASK (0x1f)

