bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_ANA_REG6_ADDR (SOC_SYS_AONP_REG_BASE + (0x46 << 2))

#define SYS_AONP_ANA_REG6_CALIB_INTERVAL_POS (0)
#define SYS_AONP_ANA_REG6_CALIB_INTERVAL_MASK (0x3ff)

#define SYS_AONP_ANA_REG6_MODIFY_INTERVAL_POS (10)
#define SYS_AONP_ANA_REG6_MODIFY_INTERVAL_MASK (0x3f)

#define SYS_AONP_ANA_REG6_XTAL_WAKEUP_TIME_POS (16)
#define SYS_AONP_ANA_REG6_XTAL_WAKEUP_TIME_MASK (0xf)

#define SYS_AONP_ANA_REG6_SPI_TRIG_POS (20)
#define SYS_AONP_ANA_REG6_SPI_TRIG_MASK (0x1)

#define SYS_AONP_ANA_REG6_MODIFI_AUTO_POS (21)
#define SYS_AONP_ANA_REG6_MODIFI_AUTO_MASK (0x1)

#define SYS_AONP_ANA_REG6_CALIB_AUTO_POS (22)
#define SYS_AONP_ANA_REG6_CALIB_AUTO_MASK (0x1)

#define SYS_AONP_ANA_REG6_CAL_MODE_POS (23)
#define SYS_AONP_ANA_REG6_CAL_MODE_MASK (0x1)

#define SYS_AONP_ANA_REG6_MANU_ENA_POS (24)
#define SYS_AONP_ANA_REG6_MANU_ENA_MASK (0x1)

#define SYS_AONP_ANA_REG6_MANU_CIN_POS (25)
#define SYS_AONP_ANA_REG6_MANU_CIN_MASK (0x7f)

#define SYS_AONP_ANA_REG7_ADDR (SOC_SYS_AONP_REG_BASE + (0x47 << 2))

#define SYS_AONP_ANA_REG7_NSYN_POS (0)
#define SYS_AONP_ANA_REG7_NSYN_MASK (0x1)

#define SYS_AONP_ANA_REG7_BANDMANUAL_POS (1)
#define SYS_AONP_ANA_REG7_BANDMANUAL_MASK (0x3f)

#define SYS_AONP_ANA_REG7_CKREF_LOOP_SEL_POS (7)
#define SYS_AONP_ANA_REG7_CKREF_LOOP_SEL_MASK (0x1)

#define SYS_AONP_ANA_REG7_IOFFS_POS (8)
#define SYS_AONP_ANA_REG7_IOFFS_MASK (0x7)

#define SYS_AONP_ANA_REG7_RESET_NLOAD_POS (11)
#define SYS_AONP_ANA_REG7_RESET_NLOAD_MASK (0x1)

#define SYS_AONP_ANA_REG7_CLOSELOOP_EN_POS (12)
#define SYS_AONP_ANA_REG7_CLOSELOOP_EN_MASK (0x1)

#define SYS_AONP_ANA_REG7_MODECAL_POS (13)
#define SYS_AONP_ANA_REG7_MODECAL_MASK (0x1)

#define SYS_AONP_ANA_REG7_SPI_RSTN_POS (14)
#define SYS_AONP_ANA_REG7_SPI_RSTN_MASK (0x1)

#define SYS_AONP_ANA_REG7_OSCCAL_TRIG_POS (15)
#define SYS_AONP_ANA_REG7_OSCCAL_TRIG_MASK (0x1)

#define SYS_AONP_ANA_REG7_MANUAL_POS (16)
#define SYS_AONP_ANA_REG7_MANUAL_MASK (0x1)

#define SYS_AONP_ANA_REG7_DIFF_POS (17)
#define SYS_AONP_ANA_REG7_DIFF_MASK (0x7)

#define SYS_AONP_ANA_REG7_ICTRLMANUAL_POS (20)
#define SYS_AONP_ANA_REG7_ICTRLMANUAL_MASK (0x7)

#define SYS_AONP_ANA_REG7_CNTI_POS (23)
#define SYS_AONP_ANA_REG7_CNTI_MASK (0x1ff)

#define SYS_AONP_ANA_REG8_ADDR (SOC_SYS_AONP_REG_BASE + (0x48 << 2))

#define SYS_AONP_ANA_REG8_RESERVED_BIT_0_30_POS (0)
#define SYS_AONP_ANA_REG8_RESERVED_BIT_0_30_MASK (0x7fffffff)

#define SYS_AONP_ANA_REG8_N_POS (31)
#define SYS_AONP_ANA_REG8_N_MASK (0x1)

#define SYS_AONP_ANA_REG9_ADDR (SOC_SYS_AONP_REG_BASE + (0x49 << 2))

#define SYS_AONP_ANA_REG9_CLK_SEL_POS (0)
#define SYS_AONP_ANA_REG9_CLK_SEL_MASK (0x1)

#define SYS_AONP_ANA_REG9_CORELDO_HP_POS (1)
#define SYS_AONP_ANA_REG9_CORELDO_HP_MASK (0x1)

#define SYS_AONP_ANA_REG9_DLDOHP_POS (2)
#define SYS_AONP_ANA_REG9_DLDOHP_MASK (0x1)

#define SYS_AONP_ANA_REG9_T_VANALDOSEL_POS (3)
#define SYS_AONP_ANA_REG9_T_VANALDOSEL_MASK (0x7)

#define SYS_AONP_ANA_REG9_R_VANALDOSEL_POS (6)
#define SYS_AONP_ANA_REG9_R_VANALDOSEL_MASK (0x7)

#define SYS_AONP_ANA_REG9_EN_TRSW_POS (9)
#define SYS_AONP_ANA_REG9_EN_TRSW_MASK (0x1)

#define SYS_AONP_ANA_REG9_ALDOHP_POS (10)
#define SYS_AONP_ANA_REG9_ALDOHP_MASK (0x1)

#define SYS_AONP_ANA_REG9_ANACURLIM_POS (11)
#define SYS_AONP_ANA_REG9_ANACURLIM_MASK (0x1)

#define SYS_AONP_ANA_REG9_HSLDO_HP_POS (12)
#define SYS_AONP_ANA_REG9_HSLDO_HP_MASK (0x1)

#define SYS_AONP_ANA_REG9_PWD_HSLDO_POS (13)
#define SYS_AONP_ANA_REG9_PWD_HSLDO_MASK (0x1)

#define SYS_AONP_ANA_REG9_ENFAST_HSLDO_POS (14)
#define SYS_AONP_ANA_REG9_ENFAST_HSLDO_MASK (0x1)

#define SYS_AONP_ANA_REG9_NC_15_15_POS (15)
#define SYS_AONP_ANA_REG9_NC_15_15_MASK (0x1)

#define SYS_AONP_ANA_REG9_VALOLDOSEL_POS (16)
#define SYS_AONP_ANA_REG9_VALOLDOSEL_MASK (0x7)

#define SYS_AONP_ANA_REG9_ALOPOWSEL_POS (19)
#define SYS_AONP_ANA_REG9_ALOPOWSEL_MASK (0x1)

#define SYS_AONP_ANA_REG9_EN_FAST_ALOLDO_POS (20)
#define SYS_AONP_ANA_REG9_EN_FAST_ALOLDO_MASK (0x1)

#define SYS_AONP_ANA_REG9_ALOLDOHP_POS (21)
#define SYS_AONP_ANA_REG9_ALOLDOHP_MASK (0x1)

#define SYS_AONP_ANA_REG9_BGCAL_POS (22)
#define SYS_AONP_ANA_REG9_BGCAL_MASK (0x3f)

#define SYS_AONP_ANA_REG9_VBGCALMODE_POS (28)
#define SYS_AONP_ANA_REG9_VBGCALMODE_MASK (0x1)

#define SYS_AONP_ANA_REG9_VBGCALSTART_POS (29)
#define SYS_AONP_ANA_REG9_VBGCALSTART_MASK (0x1)

#define SYS_AONP_ANA_REG9_PWD_BGCAL_POS (30)
#define SYS_AONP_ANA_REG9_PWD_BGCAL_MASK (0x1)

#define SYS_AONP_ANA_REG9_SPI_ENVBG_POS (31)
#define SYS_AONP_ANA_REG9_SPI_ENVBG_MASK (0x1)

#define SYS_AONP_ANA_REG10_ADDR (SOC_SYS_AONP_REG_BASE + (0x4a << 2))

#define SYS_AONP_ANA_REG10_AZCD_MANUAL_POS (0)
#define SYS_AONP_ANA_REG10_AZCD_MANUAL_MASK (0x3f)

#define SYS_AONP_ANA_REG10_AZCDREFS_POS (6)
#define SYS_AONP_ANA_REG10_AZCDREFS_MASK (0x3)

#define SYS_AONP_ANA_REG10_RESERVED_BIT_8_8_POS (8)
#define SYS_AONP_ANA_REG10_RESERVED_BIT_8_8_MASK (0x1)

#define SYS_AONP_ANA_REG10_SPI_LATCHB_POS (9)
#define SYS_AONP_ANA_REG10_SPI_LATCHB_MASK (0x1)

#define SYS_AONP_ANA_REG10_DIGCURLIM_POS (10)
#define SYS_AONP_ANA_REG10_DIGCURLIM_MASK (0x1)

#define SYS_AONP_ANA_REG10_RTC_WKRSTN_POS (11)
#define SYS_AONP_ANA_REG10_RTC_WKRSTN_MASK (0x1)

#define SYS_AONP_ANA_REG10_RST_WKS_POS (12)
#define SYS_AONP_ANA_REG10_RST_WKS_MASK (0x1)

#define SYS_AONP_ANA_REG10_D_VEASEL1V_POS (13)
#define SYS_AONP_ANA_REG10_D_VEASEL1V_MASK (0x3)

#define SYS_AONP_ANA_REG10_ENSFSDD_POS (15)
#define SYS_AONP_ANA_REG10_ENSFSDD_MASK (0x1)

#define SYS_AONP_ANA_REG10_VCOREHSEL_POS (16)
#define SYS_AONP_ANA_REG10_VCOREHSEL_MASK (0xf)

#define SYS_AONP_ANA_REG10_VCORELSEL_POS (20)
#define SYS_AONP_ANA_REG10_VCORELSEL_MASK (0x7)

#define SYS_AONP_ANA_REG10_VLDEN_POS (23)
#define SYS_AONP_ANA_REG10_VLDEN_MASK (0x1)

#define SYS_AONP_ANA_REG10_EN_FAST_CORELDO_POS (24)
#define SYS_AONP_ANA_REG10_EN_FAST_CORELDO_MASK (0x1)

#define SYS_AONP_ANA_REG10_PWDCORELDO_POS (25)
#define SYS_AONP_ANA_REG10_PWDCORELDO_MASK (0x1)

#define SYS_AONP_ANA_REG10_VDIGHSEL_POS (26)
#define SYS_AONP_ANA_REG10_VDIGHSEL_MASK (0x7)

#define SYS_AONP_ANA_REG10_VDIGSEL_POS (29)
#define SYS_AONP_ANA_REG10_VDIGSEL_MASK (0x3)

#define SYS_AONP_ANA_REG10_VDD12LDEN_POS (31)
#define SYS_AONP_ANA_REG10_VDD12LDEN_MASK (0x1)

#define SYS_AONP_ANA_REG11_ADDR (SOC_SYS_AONP_REG_BASE + (0x4b << 2))

#define SYS_AONP_ANA_REG11_ALDO_CZSEL_POS (0)
#define SYS_AONP_ANA_REG11_ALDO_CZSEL_MASK (0x7)

#define SYS_AONP_ANA_REG11_ZLDO_RZSEL_POS (3)
#define SYS_AONP_ANA_REG11_ZLDO_RZSEL_MASK (0x3)

