bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_ANA_REG11_AZCDSWVS_POS (5)
#define SYS_AONP_ANA_REG11_AZCDSWVS_MASK (0x7)

#define SYS_AONP_ANA_REG11_AENZCDDY_POS (8)
#define SYS_AONP_ANA_REG11_AENZCDDY_MASK (0x1)

#define SYS_AONP_ANA_REG11_AENZCDMSEL_POS (9)
#define SYS_AONP_ANA_REG11_AENZCDMSEL_MASK (0x1)

#define SYS_AONP_ANA_REG11_AENZCDCALIB_POS (10)
#define SYS_AONP_ANA_REG11_AENZCDCALIB_MASK (0x1)

#define SYS_AONP_ANA_REG11_EN_COREPSW_POS (11)
#define SYS_AONP_ANA_REG11_EN_COREPSW_MASK (0x1)

#define SYS_AONP_ANA_REG11_EN_ALOPSW_POS (12)
#define SYS_AONP_ANA_REG11_EN_ALOPSW_MASK (0x1)

#define SYS_AONP_ANA_REG11_NC_13_14_POS (13)
#define SYS_AONP_ANA_REG11_NC_13_14_MASK (0x3)

#define SYS_AONP_ANA_REG11_SPI_TIMERWKEN_POS (15)
#define SYS_AONP_ANA_REG11_SPI_TIMERWKEN_MASK (0x1)

#define SYS_AONP_ANA_REG11_SPI_BYP32PWD_POS (16)
#define SYS_AONP_ANA_REG11_SPI_BYP32PWD_MASK (0x1)

#define SYS_AONP_ANA_REG11_SD_POS (17)
#define SYS_AONP_ANA_REG11_SD_MASK (0x1)

#define SYS_AONP_ANA_REG11_NC_18_18_POS (18)
#define SYS_AONP_ANA_REG11_NC_18_18_MASK (0x1)

#define SYS_AONP_ANA_REG11_GPIO_WKRST1V_POS (19)
#define SYS_AONP_ANA_REG11_GPIO_WKRST1V_MASK (0x1)

#define SYS_AONP_ANA_REG11_CKFS_POS (20)
#define SYS_AONP_ANA_REG11_CKFS_MASK (0x3)

#define SYS_AONP_ANA_REG11_CKINTSEL_POS (22)
#define SYS_AONP_ANA_REG11_CKINTSEL_MASK (0x1)

#define SYS_AONP_ANA_REG11_OSCCALTRIG_POS (23)
#define SYS_AONP_ANA_REG11_OSCCALTRIG_MASK (0x1)

#define SYS_AONP_ANA_REG11_MROSCSEL_POS (24)
#define SYS_AONP_ANA_REG11_MROSCSEL_MASK (0x1)

#define SYS_AONP_ANA_REG11_MROSCI_CAL_POS (25)
#define SYS_AONP_ANA_REG11_MROSCI_CAL_MASK (0x7)

#define SYS_AONP_ANA_REG11_MROSCCAP_CAL_POS (28)
#define SYS_AONP_ANA_REG11_MROSCCAP_CAL_MASK (0xf)

#define SYS_AONP_ANA_REG12_ADDR (SOC_SYS_AONP_REG_BASE + (0x4c << 2))

#define SYS_AONP_ANA_REG12_SFSR_POS (0)
#define SYS_AONP_ANA_REG12_SFSR_MASK (0xf)

#define SYS_AONP_ANA_REG12_ENSFSAA_POS (4)
#define SYS_AONP_ANA_REG12_ENSFSAA_MASK (0x1)

#define SYS_AONP_ANA_REG12_APFMS_POS (5)
#define SYS_AONP_ANA_REG12_APFMS_MASK (0x1f)

#define SYS_AONP_ANA_REG12_ATMPO_SEL_POS (10)
#define SYS_AONP_ANA_REG12_ATMPO_SEL_MASK (0x3)

#define SYS_AONP_ANA_REG12_AMPOEN_POS (12)
#define SYS_AONP_ANA_REG12_AMPOEN_MASK (0x1)

#define SYS_AONP_ANA_REG12_ENPOWA_POS (13)
#define SYS_AONP_ANA_REG12_ENPOWA_MASK (0x1)

#define SYS_AONP_ANA_REG12_AVEA_SEL_POS (14)
#define SYS_AONP_ANA_REG12_AVEA_SEL_MASK (0x3)

#define SYS_AONP_ANA_REG12_AFORCEPFM_POS (16)
#define SYS_AONP_ANA_REG12_AFORCEPFM_MASK (0x1)

#define SYS_AONP_ANA_REG12_ACLS_POS (17)
#define SYS_AONP_ANA_REG12_ACLS_MASK (0x7)

#define SYS_AONP_ANA_REG12_ASWRSTEN_POS (20)
#define SYS_AONP_ANA_REG12_ASWRSTEN_MASK (0x1)

#define SYS_AONP_ANA_REG12_ARIPC_POS (21)
#define SYS_AONP_ANA_REG12_ARIPC_MASK (0x7)

#define SYS_AONP_ANA_REG12_ARAMPC_POS (24)
#define SYS_AONP_ANA_REG12_ARAMPC_MASK (0xf)

#define SYS_AONP_ANA_REG12_ARAMPCEN_POS (28)
#define SYS_AONP_ANA_REG12_ARAMPCEN_MASK (0x1)

#define SYS_AONP_ANA_REG12_AENBURST_POS (29)
#define SYS_AONP_ANA_REG12_AENBURST_MASK (0x1)

#define SYS_AONP_ANA_REG12_APFMEN_POS (30)
#define SYS_AONP_ANA_REG12_APFMEN_MASK (0x1)

#define SYS_AONP_ANA_REG12_ALDOSEL_POS (31)
#define SYS_AONP_ANA_REG12_ALDOSEL_MASK (0x1)

#define SYS_AONP_ANA_REG13_ADDR (SOC_SYS_AONP_REG_BASE + (0x4d << 2))

#define SYS_AONP_ANA_REG13_BUCKD_SOFTST_POS (0)
#define SYS_AONP_ANA_REG13_BUCKD_SOFTST_MASK (0xf)

#define SYS_AONP_ANA_REG13_DENZCDCALIB_POS (4)
#define SYS_AONP_ANA_REG13_DENZCDCALIB_MASK (0x1)

#define SYS_AONP_ANA_REG13_NC_5_6_POS (5)
#define SYS_AONP_ANA_REG13_NC_5_6_MASK (0x3)

#define SYS_AONP_ANA_REG13_VDDGPIO_SEL_POS (7)
#define SYS_AONP_ANA_REG13_VDDGPIO_SEL_MASK (0x1)

#define SYS_AONP_ANA_REG13_DPFMS_POS (8)
#define SYS_AONP_ANA_REG13_DPFMS_MASK (0x1f)

#define SYS_AONP_ANA_REG13_DTMPO_SEL_POS (13)
#define SYS_AONP_ANA_REG13_DTMPO_SEL_MASK (0x3)

#define SYS_AONP_ANA_REG13_DMPOEN_POS (15)
#define SYS_AONP_ANA_REG13_DMPOEN_MASK (0x1)

#define SYS_AONP_ANA_REG13_DFORCEPFM_POS (16)
#define SYS_AONP_ANA_REG13_DFORCEPFM_MASK (0x1)

#define SYS_AONP_ANA_REG13_DCLS_POS (17)
#define SYS_AONP_ANA_REG13_DCLS_MASK (0x7)

#define SYS_AONP_ANA_REG13_DSWRSTEN_POS (20)
#define SYS_AONP_ANA_REG13_DSWRSTEN_MASK (0x1)

#define SYS_AONP_ANA_REG13_DRIPC_POS (21)
#define SYS_AONP_ANA_REG13_DRIPC_MASK (0x7)

#define SYS_AONP_ANA_REG13_DRAMPC_POS (24)
#define SYS_AONP_ANA_REG13_DRAMPC_MASK (0xf)

#define SYS_AONP_ANA_REG13_DRAMPCEN_POS (28)
#define SYS_AONP_ANA_REG13_DRAMPCEN_MASK (0x1)

#define SYS_AONP_ANA_REG13_DENBURST_POS (29)
#define SYS_AONP_ANA_REG13_DENBURST_MASK (0x1)

#define SYS_AONP_ANA_REG13_DPFMEN_POS (30)
#define SYS_AONP_ANA_REG13_DPFMEN_MASK (0x1)

#define SYS_AONP_ANA_REG13_DLDOSEL_POS (31)
#define SYS_AONP_ANA_REG13_DLDOSEL_MASK (0x1)

#define SYS_AONP_ANA_REG14_ADDR (SOC_SYS_AONP_REG_BASE + (0x4e << 2))

#define SYS_AONP_ANA_REG14_PWDOVP1V_POS (0)
#define SYS_AONP_ANA_REG14_PWDOVP1V_MASK (0x1)

#define SYS_AONP_ANA_REG14_ASOFT_STC_POS (1)
#define SYS_AONP_ANA_REG14_ASOFT_STC_MASK (0xf)

#define SYS_AONP_ANA_REG14_DLDO_CZSEL_POS (5)
#define SYS_AONP_ANA_REG14_DLDO_CZSEL_MASK (0x7)

#define SYS_AONP_ANA_REG14_DLDO_RZSEL_POS (8)
#define SYS_AONP_ANA_REG14_DLDO_RZSEL_MASK (0x3)

#define SYS_AONP_ANA_REG14_EN_USBVCC18_POS (10)
#define SYS_AONP_ANA_REG14_EN_USBVCC18_MASK (0x1)

#define SYS_AONP_ANA_REG14_EN_USBVCC3V_POS (11)
#define SYS_AONP_ANA_REG14_EN_USBVCC3V_MASK (0x1)

#define SYS_AONP_ANA_REG14_VTRXSPISEL_POS (12)
#define SYS_AONP_ANA_REG14_VTRXSPISEL_MASK (0x3)

#define SYS_AONP_ANA_REG14_DENZCDDY_POS (14)
#define SYS_AONP_ANA_REG14_DENZCDDY_MASK (0x1)

#define SYS_AONP_ANA_REG14_DZCD_SWVS_POS (15)
#define SYS_AONP_ANA_REG14_DZCD_SWVS_MASK (0x7)

#define SYS_AONP_ANA_REG14_DZCD_REFS_POS (18)
#define SYS_AONP_ANA_REG14_DZCD_REFS_MASK (0x7)

#define SYS_AONP_ANA_REG14_DZCD_MANU_POS (21)
#define SYS_AONP_ANA_REG14_DZCD_MANU_MASK (0x3f)

