bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_ANA_REG14_AZCDMSEL_POS (27)
#define SYS_AONP_ANA_REG14_AZCDMSEL_MASK (0x1)

#define SYS_AONP_ANA_REG14_PSLDO_SWB_POS (28)
#define SYS_AONP_ANA_REG14_PSLDO_SWB_MASK (0x1)

#define SYS_AONP_ANA_REG14_VPSRAMSEL_POS (29)
#define SYS_AONP_ANA_REG14_VPSRAMSEL_MASK (0x3)

#define SYS_AONP_ANA_REG14_ENPSRAM_POS (31)
#define SYS_AONP_ANA_REG14_ENPSRAM_MASK (0x1)

#define SYS_AONP_ANA_REG15_ADDR (SOC_SYS_AONP_REG_BASE + (0x4f << 2))

#define SYS_AONP_ANA_REG15_GPIOWKEN_POS (0)
#define SYS_AONP_ANA_REG15_GPIOWKEN_MASK (0xffffffff)

#define SYS_AONP_ANA_REG16_ADDR (SOC_SYS_AONP_REG_BASE + (0x50 << 2))

#define SYS_AONP_ANA_REG16_TIMER_SET_POS (0)
#define SYS_AONP_ANA_REG16_TIMER_SET_MASK (0xf)

#define SYS_AONP_ANA_REG16_RTC_SET_POS (4)
#define SYS_AONP_ANA_REG16_RTC_SET_MASK (0xf)

#define SYS_AONP_ANA_REG16_NC_8_10_POS (8)
#define SYS_AONP_ANA_REG16_NC_8_10_MASK (0x7)

#define SYS_AONP_ANA_REG16_VCOREHSSEL_POS (11)
#define SYS_AONP_ANA_REG16_VCOREHSSEL_MASK (0xf)

#define SYS_AONP_ANA_REG16_VBUCKHSSEL_POS (15)
#define SYS_AONP_ANA_REG16_VBUCKHSSEL_MASK (0x7)

#define SYS_AONP_ANA_REG16_HSENFAST_POS (18)
#define SYS_AONP_ANA_REG16_HSENFAST_MASK (0x1)

#define SYS_AONP_ANA_REG16_ENHSPW_POS (19)
#define SYS_AONP_ANA_REG16_ENHSPW_MASK (0x1)

#define SYS_AONP_ANA_REG16_BUCKHS_SOFT_STC_POS (20)
#define SYS_AONP_ANA_REG16_BUCKHS_SOFT_STC_MASK (0xf)

#define SYS_AONP_ANA_REG16_HS_VEASEL_POS (24)
#define SYS_AONP_ANA_REG16_HS_VEASEL_MASK (0x3)

#define SYS_AONP_ANA_REG16_HSZCD_MANUAL_POS (26)
#define SYS_AONP_ANA_REG16_HSZCD_MANUAL_MASK (0x3f)

#define SYS_AONP_ANA_REG17_ADDR (SOC_SYS_AONP_REG_BASE + (0x51 << 2))

#define SYS_AONP_ANA_REG17_RTC_SET_POS (0)
#define SYS_AONP_ANA_REG17_RTC_SET_MASK (0xffffffff)

#define SYS_AONP_ANA_REG18_ADDR (SOC_SYS_AONP_REG_BASE + (0x52 << 2))

#define SYS_AONP_ANA_REG18_TIMER_SET_POS (0)
#define SYS_AONP_ANA_REG18_TIMER_SET_MASK (0xffffffff)

#define SYS_AONP_ANA_REG19_ADDR (SOC_SYS_AONP_REG_BASE + (0x53 << 2))

#define SYS_AONP_ANA_REG19_HSENZCDDY_POS (0)
#define SYS_AONP_ANA_REG19_HSENZCDDY_MASK (0x1)

#define SYS_AONP_ANA_REG19_HSENZCDCALIB_POS (1)
#define SYS_AONP_ANA_REG19_HSENZCDCALIB_MASK (0x1)

#define SYS_AONP_ANA_REG19_HSZCDSWVS_POS (2)
#define SYS_AONP_ANA_REG19_HSZCDSWVS_MASK (0x7)

#define SYS_AONP_ANA_REG19_HSZCDREFS_POS (5)
#define SYS_AONP_ANA_REG19_HSZCDREFS_MASK (0x7)

#define SYS_AONP_ANA_REG19_HSZCDMSEL_POS (8)
#define SYS_AONP_ANA_REG19_HSZCDMSEL_MASK (0x1)

#define SYS_AONP_ANA_REG19_HSPFMS_POS (9)
#define SYS_AONP_ANA_REG19_HSPFMS_MASK (0x1f)

#define SYS_AONP_ANA_REG19_HSTMPO_SEL_POS (14)
#define SYS_AONP_ANA_REG19_HSTMPO_SEL_MASK (0x3)

#define SYS_AONP_ANA_REG19_HSMPOEN_POS (16)
#define SYS_AONP_ANA_REG19_HSMPOEN_MASK (0x1)

#define SYS_AONP_ANA_REG19_HSFORCEPFM_POS (17)
#define SYS_AONP_ANA_REG19_HSFORCEPFM_MASK (0x1)

#define SYS_AONP_ANA_REG19_HSCLS_POS (18)
#define SYS_AONP_ANA_REG19_HSCLS_MASK (0x7)

#define SYS_AONP_ANA_REG19_HSSWRSTEN_POS (21)
#define SYS_AONP_ANA_REG19_HSSWRSTEN_MASK (0x1)

#define SYS_AONP_ANA_REG19_HSRIPC_POS (22)
#define SYS_AONP_ANA_REG19_HSRIPC_MASK (0x7)

#define SYS_AONP_ANA_REG19_HSRAMPC_POS (25)
#define SYS_AONP_ANA_REG19_HSRAMPC_MASK (0xf)

#define SYS_AONP_ANA_REG19_HSRAMPCEN_POS (29)
#define SYS_AONP_ANA_REG19_HSRAMPCEN_MASK (0x1)

#define SYS_AONP_ANA_REG19_HSENBURST_POS (30)
#define SYS_AONP_ANA_REG19_HSENBURST_MASK (0x1)

#define SYS_AONP_ANA_REG19_HSPFMEN_POS (31)
#define SYS_AONP_ANA_REG19_HSPFMEN_MASK (0x1)

#define SYS_AONP_ANA_REG20_ADDR (SOC_SYS_AONP_REG_BASE + (0x54 << 2))

#define SYS_AONP_ANA_REG20_ISELAUD_POS (0)
#define SYS_AONP_ANA_REG20_ISELAUD_MASK (0x1)

#define SYS_AONP_ANA_REG20_AUDCK_RLCEN_POS (1)
#define SYS_AONP_ANA_REG20_AUDCK_RLCEN_MASK (0x1)

#define SYS_AONP_ANA_REG20_LCHCKINVEN_POS (2)
#define SYS_AONP_ANA_REG20_LCHCKINVEN_MASK (0x1)

#define SYS_AONP_ANA_REG20_ENAUDBIAS_POS (3)
#define SYS_AONP_ANA_REG20_ENAUDBIAS_MASK (0x1)

#define SYS_AONP_ANA_REG20_ENADCBIAS_POS (4)
#define SYS_AONP_ANA_REG20_ENADCBIAS_MASK (0x1)

#define SYS_AONP_ANA_REG20_ENMICBIAS_POS (5)
#define SYS_AONP_ANA_REG20_ENMICBIAS_MASK (0x1)

#define SYS_AONP_ANA_REG20_ADCCKINVEN_POS (6)
#define SYS_AONP_ANA_REG20_ADCCKINVEN_MASK (0x1)

#define SYS_AONP_ANA_REG20_SPI_POS (7)
#define SYS_AONP_ANA_REG20_SPI_MASK (0x1)

#define SYS_AONP_ANA_REG20_ADCTSTEN_POS (8)
#define SYS_AONP_ANA_REG20_ADCTSTEN_MASK (0x1)

#define SYS_AONP_ANA_REG20_MICBIAS_TRM_POS (9)
#define SYS_AONP_ANA_REG20_MICBIAS_TRM_MASK (0x3)

#define SYS_AONP_ANA_REG20_MICBIAS_VOC_POS (11)
#define SYS_AONP_ANA_REG20_MICBIAS_VOC_MASK (0x1f)

#define SYS_AONP_ANA_REG20_VREFSEL_POS (16)
#define SYS_AONP_ANA_REG20_VREFSEL_MASK (0x1)

#define SYS_AONP_ANA_REG20_CAPSW_POS (17)
#define SYS_AONP_ANA_REG20_CAPSW_MASK (0x1f)

#define SYS_AONP_ANA_REG20_ADCREF_SEL_POS (22)
#define SYS_AONP_ANA_REG20_ADCREF_SEL_MASK (0x3)

#define SYS_AONP_ANA_REG20_ADCVCMSEL_POS (24)
#define SYS_AONP_ANA_REG20_ADCVCMSEL_MASK (0x3)

#define SYS_AONP_ANA_REG20_SPI_1_POS (26)
#define SYS_AONP_ANA_REG20_SPI_1_MASK (0x1)

#define SYS_AONP_ANA_REG20_AUDADJREF_POS (27)
#define SYS_AONP_ANA_REG20_AUDADJREF_MASK (0x1f)

#define SYS_AONP_ANA_REG21_ADDR (SOC_SYS_AONP_REG_BASE + (0x55 << 2))

#define SYS_AONP_ANA_REG21_ISEL_MIC1_POS (0)
#define SYS_AONP_ANA_REG21_ISEL_MIC1_MASK (0x3)

#define SYS_AONP_ANA_REG21_MICIRSEL1_MIC1_POS (2)
#define SYS_AONP_ANA_REG21_MICIRSEL1_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_VCMSEL_MIC1_POS (3)
#define SYS_AONP_ANA_REG21_VCMSEL_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_ENFSR_MIC1_POS (4)
#define SYS_AONP_ANA_REG21_ENFSR_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_ENOPOCLIP_MIC1_POS (5)
#define SYS_AONP_ANA_REG21_ENOPOCLIP_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_DA2ADEN_MIC1_POS (6)
#define SYS_AONP_ANA_REG21_DA2ADEN_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_IMATCH_MIC1_POS (7)
#define SYS_AONP_ANA_REG21_IMATCH_MIC1_MASK (0xf)

#define SYS_AONP_ANA_REG21_IMATCH_EN_MIC1_POS (11)
#define SYS_AONP_ANA_REG21_IMATCH_EN_MIC1_MASK (0x1)

