bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_ANA_REG21_DCCOMPEN_MIC1_POS (12)
#define SYS_AONP_ANA_REG21_DCCOMPEN_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_MICSINGLEEN_MIC1_POS (13)
#define SYS_AONP_ANA_REG21_MICSINGLEEN_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_NC_14_14_POS (14)
#define SYS_AONP_ANA_REG21_NC_14_14_MASK (0x1)

#define SYS_AONP_ANA_REG21_MICGAIN_MIC1_POS (15)
#define SYS_AONP_ANA_REG21_MICGAIN_MIC1_MASK (0xf)

#define SYS_AONP_ANA_REG21_NC_19_23_POS (19)
#define SYS_AONP_ANA_REG21_NC_19_23_MASK (0x1f)

#define SYS_AONP_ANA_REG21_DWAMODE_MIC1_POS (24)
#define SYS_AONP_ANA_REG21_DWAMODE_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_NC_25_27_POS (25)
#define SYS_AONP_ANA_REG21_NC_25_27_MASK (0x7)

#define SYS_AONP_ANA_REG21_MICEN_MIC1_POS (28)
#define SYS_AONP_ANA_REG21_MICEN_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_RST_MIC1_POS (29)
#define SYS_AONP_ANA_REG21_RST_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_BPDWA1V_MIC1_POS (30)
#define SYS_AONP_ANA_REG21_BPDWA1V_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG21_HCEN1STG_MIC1_POS (31)
#define SYS_AONP_ANA_REG21_HCEN1STG_MIC1_MASK (0x1)

#define SYS_AONP_ANA_REG22_ADDR (SOC_SYS_AONP_REG_BASE + (0x56 << 2))

#define SYS_AONP_ANA_REG22_ICTRL_DSPPLL_POS (0)
#define SYS_AONP_ANA_REG22_ICTRL_DSPPLL_MASK (0x1)

#define SYS_AONP_ANA_REG22_LVREF_POS (1)
#define SYS_AONP_ANA_REG22_LVREF_MASK (0x3)

#define SYS_AONP_ANA_REG22_RESERVED_BIT_3_3_POS (3)
#define SYS_AONP_ANA_REG22_RESERVED_BIT_3_3_MASK (0x1)

#define SYS_AONP_ANA_REG22_NC_4_18_POS (4)
#define SYS_AONP_ANA_REG22_NC_4_18_MASK (0x7fff)

#define SYS_AONP_ANA_REG22_MODE_POS (19)
#define SYS_AONP_ANA_REG22_MODE_MASK (0x1)

#define SYS_AONP_ANA_REG22_IAMSEL_POS (20)
#define SYS_AONP_ANA_REG22_IAMSEL_MASK (0x1)

#define SYS_AONP_ANA_REG22_HVREF_POS (21)
#define SYS_AONP_ANA_REG22_HVREF_MASK (0x3)

#define SYS_AONP_ANA_REG22_LVREF_1_POS (23)
#define SYS_AONP_ANA_REG22_LVREF_1_MASK (0x3)

#define SYS_AONP_ANA_REG22_NC_25_31_POS (25)
#define SYS_AONP_ANA_REG22_NC_25_31_MASK (0x7f)

#define SYS_AONP_ANA_REG23_ADDR (SOC_SYS_AONP_REG_BASE + (0x57 << 2))

#define SYS_AONP_ANA_REG23_CAMSEL_POS (0)
#define SYS_AONP_ANA_REG23_CAMSEL_MASK (0x1)

#define SYS_AONP_ANA_REG23_MSW_POS (1)
#define SYS_AONP_ANA_REG23_MSW_MASK (0x1ff)

#define SYS_AONP_ANA_REG23_TSTCKEN_DPLL_POS (10)
#define SYS_AONP_ANA_REG23_TSTCKEN_DPLL_MASK (0x1)

#define SYS_AONP_ANA_REG23_OSCCAL_TRIG_POS (11)
#define SYS_AONP_ANA_REG23_OSCCAL_TRIG_MASK (0x1)

#define SYS_AONP_ANA_REG23_CNTI_POS (12)
#define SYS_AONP_ANA_REG23_CNTI_MASK (0x1ff)

#define SYS_AONP_ANA_REG23_NC_21_21_POS (21)
#define SYS_AONP_ANA_REG23_NC_21_21_MASK (0x1)

#define SYS_AONP_ANA_REG23_SPI_RST_POS (22)
#define SYS_AONP_ANA_REG23_SPI_RST_MASK (0x1)

#define SYS_AONP_ANA_REG23_CLOSELOOP_EN_POS (23)
#define SYS_AONP_ANA_REG23_CLOSELOOP_EN_MASK (0x1)

#define SYS_AONP_ANA_REG23_CALTIME_POS (24)
#define SYS_AONP_ANA_REG23_CALTIME_MASK (0x1)

#define SYS_AONP_ANA_REG23_LPFRZ_POS (25)
#define SYS_AONP_ANA_REG23_LPFRZ_MASK (0x3)

#define SYS_AONP_ANA_REG23_ICP_POS (27)
#define SYS_AONP_ANA_REG23_ICP_MASK (0xf)

#define SYS_AONP_ANA_REG23_CP2CTRL_POS (31)
#define SYS_AONP_ANA_REG23_CP2CTRL_MASK (0x1)

#define SYS_AONP_ANA_REG24_ADDR (SOC_SYS_AONP_REG_BASE + (0x58 << 2))

#define SYS_AONP_ANA_REG24_NC_0_31_POS (0)
#define SYS_AONP_ANA_REG24_NC_0_31_MASK (0xffffffff)

#define SYS_AONP_ANA_REG25_ADDR (SOC_SYS_AONP_REG_BASE + (0x59 << 2))

#define SYS_AONP_ANA_REG25_INT_MOD_POS (0)
#define SYS_AONP_ANA_REG25_INT_MOD_MASK (0x1)

#define SYS_AONP_ANA_REG25_NSYN_POS (1)
#define SYS_AONP_ANA_REG25_NSYN_MASK (0x1)

#define SYS_AONP_ANA_REG25_OPEN_ENB_POS (2)
#define SYS_AONP_ANA_REG25_OPEN_ENB_MASK (0x1)

#define SYS_AONP_ANA_REG25_RESET_POS (3)
#define SYS_AONP_ANA_REG25_RESET_MASK (0x1)

#define SYS_AONP_ANA_REG25_IOFFSETL_POS (4)
#define SYS_AONP_ANA_REG25_IOFFSETL_MASK (0x7)

#define SYS_AONP_ANA_REG25_LPFRZ_POS (7)
#define SYS_AONP_ANA_REG25_LPFRZ_MASK (0xf)

#define SYS_AONP_ANA_REG25_VSEL_POS (11)
#define SYS_AONP_ANA_REG25_VSEL_MASK (0x7)

#define SYS_AONP_ANA_REG25_VSEL_CAL_POS (14)
#define SYS_AONP_ANA_REG25_VSEL_CAL_MASK (0x1)

#define SYS_AONP_ANA_REG25_PWD_LOCKDET_POS (15)
#define SYS_AONP_ANA_REG25_PWD_LOCKDET_MASK (0x1)

#define SYS_AONP_ANA_REG25_LOCKDET_BYPASS_POS (16)
#define SYS_AONP_ANA_REG25_LOCKDET_BYPASS_MASK (0x1)

#define SYS_AONP_ANA_REG25_CKREF_LOOP_SEL_POS (17)
#define SYS_AONP_ANA_REG25_CKREF_LOOP_SEL_MASK (0x1)

#define SYS_AONP_ANA_REG25_SPI_TRIGGER_POS (18)
#define SYS_AONP_ANA_REG25_SPI_TRIGGER_MASK (0x1)

#define SYS_AONP_ANA_REG25_MANUAL_POS (19)
#define SYS_AONP_ANA_REG25_MANUAL_MASK (0x1)

#define SYS_AONP_ANA_REG25_TEST_CKAUDIO_EN_POS (20)
#define SYS_AONP_ANA_REG25_TEST_CKAUDIO_EN_MASK (0x1)

#define SYS_AONP_ANA_REG25_CK2XEN_POS (21)
#define SYS_AONP_ANA_REG25_CK2XEN_MASK (0x1)

#define SYS_AONP_ANA_REG25_ICP_POS (22)
#define SYS_AONP_ANA_REG25_ICP_MASK (0x3)

#define SYS_AONP_ANA_REG25_CKTST_SEL_POS (24)
#define SYS_AONP_ANA_REG25_CKTST_SEL_MASK (0x1)

#define SYS_AONP_ANA_REG25_EDGESEL_NCK_POS (25)
#define SYS_AONP_ANA_REG25_EDGESEL_NCK_MASK (0x1)

#define SYS_AONP_ANA_REG25_NLOADDLYEN_POS (26)
#define SYS_AONP_ANA_REG25_NLOADDLYEN_MASK (0x1)

#define SYS_AONP_ANA_REG25_BYPASS_CALDONE_AUTO_POS (27)
#define SYS_AONP_ANA_REG25_BYPASS_CALDONE_AUTO_MASK (0x1)

#define SYS_AONP_ANA_REG25_CAL_RES_SPI_POS (28)
#define SYS_AONP_ANA_REG25_CAL_RES_SPI_MASK (0x7)

#define SYS_AONP_ANA_REG25_AUDIOEN_POS (31)
#define SYS_AONP_ANA_REG25_AUDIOEN_MASK (0x1)

#define SYS_AONP_ANA_REG26_ADDR (SOC_SYS_AONP_REG_BASE + (0x5a << 2))

#define SYS_AONP_ANA_REG26_N_POS (0)
#define SYS_AONP_ANA_REG26_N_MASK (0x3fffffff)

#define SYS_AONP_ANA_REG26_CALRES_SPIEN_POS (30)
#define SYS_AONP_ANA_REG26_CALRES_SPIEN_MASK (0x1)

#define SYS_AONP_ANA_REG26_CALREFEN_POS (31)
#define SYS_AONP_ANA_REG26_CALREFEN_MASK (0x1)

#define SYS_AONP_ANA_REG27_ADDR (SOC_SYS_AONP_REG_BASE + (0x5b << 2))

#define SYS_AONP_ANA_REG27_ISEL_MIC2_POS (0)
#define SYS_AONP_ANA_REG27_ISEL_MIC2_MASK (0x3)

