bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_ANA_REG27_MICIRSEL1_MIC2_POS (2)
#define SYS_AONP_ANA_REG27_MICIRSEL1_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_VCMSEL_MIC2_POS (3)
#define SYS_AONP_ANA_REG27_VCMSEL_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_ENFSR_MIC2_POS (4)
#define SYS_AONP_ANA_REG27_ENFSR_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_ENOPOCLIP_MIC2_POS (5)
#define SYS_AONP_ANA_REG27_ENOPOCLIP_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_DA2ADEN_MIC2_POS (6)
#define SYS_AONP_ANA_REG27_DA2ADEN_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_IMATCH_MIC2_POS (7)
#define SYS_AONP_ANA_REG27_IMATCH_MIC2_MASK (0xf)

#define SYS_AONP_ANA_REG27_IMATCH_EN_MIC2_POS (11)
#define SYS_AONP_ANA_REG27_IMATCH_EN_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_DCCOMPEN_MIC2_POS (12)
#define SYS_AONP_ANA_REG27_DCCOMPEN_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_MICSINGLEEN_MIC2_POS (13)
#define SYS_AONP_ANA_REG27_MICSINGLEEN_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_NC_14_14_POS (14)
#define SYS_AONP_ANA_REG27_NC_14_14_MASK (0x1)

#define SYS_AONP_ANA_REG27_MICGAIN_MIC2_POS (15)
#define SYS_AONP_ANA_REG27_MICGAIN_MIC2_MASK (0xf)

#define SYS_AONP_ANA_REG27_NC_19_23_POS (19)
#define SYS_AONP_ANA_REG27_NC_19_23_MASK (0x1f)

#define SYS_AONP_ANA_REG27_DWAMODE_MIC2_POS (24)
#define SYS_AONP_ANA_REG27_DWAMODE_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_NC_25_27_POS (25)
#define SYS_AONP_ANA_REG27_NC_25_27_MASK (0x7)

#define SYS_AONP_ANA_REG27_MICEN_MIC2_POS (28)
#define SYS_AONP_ANA_REG27_MICEN_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_RST_MIC2_POS (29)
#define SYS_AONP_ANA_REG27_RST_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_BPDWA1V_MIC2_POS (30)
#define SYS_AONP_ANA_REG27_BPDWA1V_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG27_HCEN1STG_MIC2_POS (31)
#define SYS_AONP_ANA_REG27_HCEN1STG_MIC2_MASK (0x1)

#define SYS_AONP_ANA_REG28_ADDR (SOC_SYS_AONP_REG_BASE + (0x5c << 2))

#define SYS_AONP_ANA_REG28_ISEL_MIC3_POS (0)
#define SYS_AONP_ANA_REG28_ISEL_MIC3_MASK (0x3)

#define SYS_AONP_ANA_REG28_MICIRSEL1_MIC3_POS (2)
#define SYS_AONP_ANA_REG28_MICIRSEL1_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_VCMSEL_MIC3_POS (3)
#define SYS_AONP_ANA_REG28_VCMSEL_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_ENFSR_MIC3_POS (4)
#define SYS_AONP_ANA_REG28_ENFSR_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_ENOPOCLIP_MIC3_POS (5)
#define SYS_AONP_ANA_REG28_ENOPOCLIP_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_DA2ADEN_MIC3_POS (6)
#define SYS_AONP_ANA_REG28_DA2ADEN_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_IMATCH_MIC3_POS (7)
#define SYS_AONP_ANA_REG28_IMATCH_MIC3_MASK (0xf)

#define SYS_AONP_ANA_REG28_IMATCH_EN_MIC3_POS (11)
#define SYS_AONP_ANA_REG28_IMATCH_EN_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_DCCOMPEN_MIC3_POS (12)
#define SYS_AONP_ANA_REG28_DCCOMPEN_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_MICSINGLEEN_MIC3_POS (13)
#define SYS_AONP_ANA_REG28_MICSINGLEEN_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_NC_14_14_POS (14)
#define SYS_AONP_ANA_REG28_NC_14_14_MASK (0x1)

#define SYS_AONP_ANA_REG28_MICGAIN_MIC3_POS (15)
#define SYS_AONP_ANA_REG28_MICGAIN_MIC3_MASK (0xf)

#define SYS_AONP_ANA_REG28_NC_19_23_POS (19)
#define SYS_AONP_ANA_REG28_NC_19_23_MASK (0x1f)

#define SYS_AONP_ANA_REG28_DWAMODE_MIC3_POS (24)
#define SYS_AONP_ANA_REG28_DWAMODE_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_NC_25_27_POS (25)
#define SYS_AONP_ANA_REG28_NC_25_27_MASK (0x7)

#define SYS_AONP_ANA_REG28_MICEN_MIC3_POS (28)
#define SYS_AONP_ANA_REG28_MICEN_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_RST_MIC3_POS (29)
#define SYS_AONP_ANA_REG28_RST_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_BPDWA1V_MIC3_POS (30)
#define SYS_AONP_ANA_REG28_BPDWA1V_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG28_HCEN1STG_MIC3_POS (31)
#define SYS_AONP_ANA_REG28_HCEN1STG_MIC3_MASK (0x1)

#define SYS_AONP_ANA_REG29_ADDR (SOC_SYS_AONP_REG_BASE + (0x5d << 2))

#define SYS_AONP_ANA_REG29_HPDAC_POS (0)
#define SYS_AONP_ANA_REG29_HPDAC_MASK (0x1)

#define SYS_AONP_ANA_REG29_ISELSTG_POS (1)
#define SYS_AONP_ANA_REG29_ISELSTG_MASK (0x1)

#define SYS_AONP_ANA_REG29_OSCDAC_POS (2)
#define SYS_AONP_ANA_REG29_OSCDAC_MASK (0x3)

#define SYS_AONP_ANA_REG29_OCENDAC_POS (4)
#define SYS_AONP_ANA_REG29_OCENDAC_MASK (0x1)

#define SYS_AONP_ANA_REG29_VSELDCO_POS (5)
#define SYS_AONP_ANA_REG29_VSELDCO_MASK (0x1)

#define SYS_AONP_ANA_REG29_SRSEL_POS (6)
#define SYS_AONP_ANA_REG29_SRSEL_MASK (0x1)

#define SYS_AONP_ANA_REG29_HPOEN_POS (7)
#define SYS_AONP_ANA_REG29_HPOEN_MASK (0x1)

#define SYS_AONP_ANA_REG29_LBWEN_POS (8)
#define SYS_AONP_ANA_REG29_LBWEN_MASK (0x1)

#define SYS_AONP_ANA_REG29_CALSEL_POS (9)
#define SYS_AONP_ANA_REG29_CALSEL_MASK (0x1)

#define SYS_AONP_ANA_REG29_BP2VLDO_POS (10)
#define SYS_AONP_ANA_REG29_BP2VLDO_MASK (0x1)

#define SYS_AONP_ANA_REG29_DCOCHG_POS (11)
#define SYS_AONP_ANA_REG29_DCOCHG_MASK (0x3)

#define SYS_AONP_ANA_REG29_DIFFEN_POS (13)
#define SYS_AONP_ANA_REG29_DIFFEN_MASK (0x1)

#define SYS_AONP_ANA_REG29_ENDACCAL_POS (14)
#define SYS_AONP_ANA_REG29_ENDACCAL_MASK (0x1)

#define SYS_AONP_ANA_REG29_RENDCOC_POS (15)
#define SYS_AONP_ANA_REG29_RENDCOC_MASK (0x1)

#define SYS_AONP_ANA_REG29_LENDCOC_POS (16)
#define SYS_AONP_ANA_REG29_LENDCOC_MASK (0x1)

#define SYS_AONP_ANA_REG29_RENVCMD_POS (17)
#define SYS_AONP_ANA_REG29_RENVCMD_MASK (0x1)

#define SYS_AONP_ANA_REG29_LENVCMD_POS (18)
#define SYS_AONP_ANA_REG29_LENVCMD_MASK (0x1)

#define SYS_AONP_ANA_REG29_DACDRVEN_POS (19)
#define SYS_AONP_ANA_REG29_DACDRVEN_MASK (0x1)

#define SYS_AONP_ANA_REG29_DACREN_POS (20)
#define SYS_AONP_ANA_REG29_DACREN_MASK (0x1)

#define SYS_AONP_ANA_REG29_DACLEN_POS (21)
#define SYS_AONP_ANA_REG29_DACLEN_MASK (0x1)

#define SYS_AONP_ANA_REG29_DACG_POS (22)
#define SYS_AONP_ANA_REG29_DACG_MASK (0xf)

#define SYS_AONP_ANA_REG29_DACMUTE_POS (26)
#define SYS_AONP_ANA_REG29_DACMUTE_MASK (0x1)

#define SYS_AONP_ANA_REG29_DACDWAMODE_SEL_POS (27)
#define SYS_AONP_ANA_REG29_DACDWAMODE_SEL_MASK (0x1)

#define SYS_AONP_ANA_REG29_CKPSEL_POS (28)
#define SYS_AONP_ANA_REG29_CKPSEL_MASK (0x1)

#define SYS_AONP_ANA_REG29_NC_29_31_POS (29)
#define SYS_AONP_ANA_REG29_NC_29_31_MASK (0x7)

#define SYS_AONP_ANA_REG30_ADDR (SOC_SYS_AONP_REG_BASE + (0x5e << 2))

#define SYS_AONP_ANA_REG30_LMDCIN_POS (0)
#define SYS_AONP_ANA_REG30_LMDCIN_MASK (0xff)

#define SYS_AONP_ANA_REG30_RMDCIN_POS (8)
#define SYS_AONP_ANA_REG30_RMDCIN_MASK (0xff)

