bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/sys_aonp_reg.h
#define SYS_AONP_ANA_REG30_SPIRST_OVC_POS (16)
#define SYS_AONP_ANA_REG30_SPIRST_OVC_MASK (0x1)

#define SYS_AONP_ANA_REG30_ENIDACR_POS (17)
#define SYS_AONP_ANA_REG30_ENIDACR_MASK (0x1)

#define SYS_AONP_ANA_REG30_ENIDACL_POS (18)
#define SYS_AONP_ANA_REG30_ENIDACL_MASK (0x1)

#define SYS_AONP_ANA_REG30_DAC3RDHC0V9_POS (19)
#define SYS_AONP_ANA_REG30_DAC3RDHC0V9_MASK (0x1)

#define SYS_AONP_ANA_REG30_HC2S_POS (20)
#define SYS_AONP_ANA_REG30_HC2S_MASK (0x1)

#define SYS_AONP_ANA_REG30_SNG_FB_EN_POS (21)
#define SYS_AONP_ANA_REG30_SNG_FB_EN_MASK (0x1)

#define SYS_AONP_ANA_REG30_RFB_CTRL_POS (22)
#define SYS_AONP_ANA_REG30_RFB_CTRL_MASK (0x1)

#define SYS_AONP_ANA_REG30_ENBS_POS (23)
#define SYS_AONP_ANA_REG30_ENBS_MASK (0x1)

#define SYS_AONP_ANA_REG30_CALCK_SEL0V9_POS (24)
#define SYS_AONP_ANA_REG30_CALCK_SEL0V9_MASK (0x1)

#define SYS_AONP_ANA_REG30_BPDWA0V9_POS (25)
#define SYS_AONP_ANA_REG30_BPDWA0V9_MASK (0x1)

#define SYS_AONP_ANA_REG30_LOOPRST0V9_POS (26)
#define SYS_AONP_ANA_REG30_LOOPRST0V9_MASK (0x1)

#define SYS_AONP_ANA_REG30_OCT0V9_POS (27)
#define SYS_AONP_ANA_REG30_OCT0V9_MASK (0x3)

#define SYS_AONP_ANA_REG30_SOUT0V9_POS (29)
#define SYS_AONP_ANA_REG30_SOUT0V9_MASK (0x1)

#define SYS_AONP_ANA_REG30_HC0V9_POS (30)
#define SYS_AONP_ANA_REG30_HC0V9_MASK (0x3)

#define SYS_AONP_ANA_REG31_ADDR (SOC_SYS_AONP_REG_BASE + (0x5f << 2))

#define SYS_AONP_ANA_REG31_NC_0_31_POS (0)
#define SYS_AONP_ANA_REG31_NC_0_31_MASK (0xffffffff)

#define SYS_AONP_ANA_REG32_ADDR (SOC_SYS_AONP_REG_BASE + (0x60 << 2))

#define SYS_AONP_ANA_REG32_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG32_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG33_ADDR (SOC_SYS_AONP_REG_BASE + (0x61 << 2))

#define SYS_AONP_ANA_REG33_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG33_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG34_ADDR (SOC_SYS_AONP_REG_BASE + (0x62 << 2))

#define SYS_AONP_ANA_REG34_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG34_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG35_ADDR (SOC_SYS_AONP_REG_BASE + (0x63 << 2))

#define SYS_AONP_ANA_REG35_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG35_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG36_ADDR (SOC_SYS_AONP_REG_BASE + (0x64 << 2))

#define SYS_AONP_ANA_REG36_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG36_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG37_ADDR (SOC_SYS_AONP_REG_BASE + (0x65 << 2))

#define SYS_AONP_ANA_REG37_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG37_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG38_ADDR (SOC_SYS_AONP_REG_BASE + (0x66 << 2))

#define SYS_AONP_ANA_REG38_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG38_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG39_ADDR (SOC_SYS_AONP_REG_BASE + (0x67 << 2))

#define SYS_AONP_ANA_REG39_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG39_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG40_ADDR (SOC_SYS_AONP_REG_BASE + (0x68 << 2))

#define SYS_AONP_ANA_REG40_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG40_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG41_ADDR (SOC_SYS_AONP_REG_BASE + (0x69 << 2))

#define SYS_AONP_ANA_REG41_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG41_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG42_ADDR (SOC_SYS_AONP_REG_BASE + (0x6a << 2))

#define SYS_AONP_ANA_REG42_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG42_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG43_ADDR (SOC_SYS_AONP_REG_BASE + (0x6b << 2))

#define SYS_AONP_ANA_REG43_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG43_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG44_ADDR (SOC_SYS_AONP_REG_BASE + (0x6c << 2))

#define SYS_AONP_ANA_REG44_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG44_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG45_ADDR (SOC_SYS_AONP_REG_BASE + (0x6d << 2))

#define SYS_AONP_ANA_REG45_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG45_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG46_ADDR (SOC_SYS_AONP_REG_BASE + (0x6e << 2))

#define SYS_AONP_ANA_REG46_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG46_NEW_ANA_REG_MASK (0xffffffff)

#define SYS_AONP_ANA_REG47_ADDR (SOC_SYS_AONP_REG_BASE + (0x6f << 2))

#define SYS_AONP_ANA_REG47_NEW_ANA_REG_POS (0)
#define SYS_AONP_ANA_REG47_NEW_ANA_REG_MASK (0xffffffff)

#ifdef __cplusplus
}
#endif
